
*** Dumping AST Record Layout
         0 | class std::exception
         0 |   (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __last_branch_record
         0 |   __uint64_t __from_ip
         8 |   __uint64_t __to_ip
    16:0-0 |   __uint32_t __mispredict
    16:1-1 |   __uint32_t __tsx_abort
    16:2-2 |   __uint32_t __in_tsx
   16:3-18 |   __uint32_t __cycle_count
   18:3-15 |   __uint32_t __reserved
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_alloc
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_array_new_length
         0 |   class std::bad_alloc (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::piecewise_construct_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__value_init_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__less<void, void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__identity (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__always_false (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__murmur2_or_cityhash<unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::_PairT
         0 |   size_t first
         8 |   size_t second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__unary_function_keep_layout_base<struct std::_PairT, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__scalar_hash<struct std::_PairT> (empty)
         0 |   struct std::__unary_function_keep_layout_base<struct std::_PairT, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__unary_function_keep_layout_base<float, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__scalar_hash<float> (empty)
         0 |   struct std::__unary_function_keep_layout_base<float, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__unary_function_keep_layout_base<double, unsigned long> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__scalar_hash<double> (empty)
         0 |   struct std::__unary_function_keep_layout_base<double, unsigned long> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__functional/hash.h:480:7)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__functional/hash.h:478:5)
         0 |   long double __t
         0 |   struct (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__functional/hash.h:480:7) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::type_info
         0 |   (type_info vtable pointer)
         8 |   __impl::__type_name_t __type_name
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_cast
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_weak_ptr
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__shared_count
         0 |   (__shared_count vtable pointer)
         8 |   long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__shared_weak_count
         0 |   class std::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
        16 |   long __shared_weak_owners_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::less<void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__sp_mut
         0 |   void * __lx_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::allocator_arg_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | union (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/math.h:219:5)
         0 |   float __f
         0 |   unsigned int __u
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | union (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/math.h:224:5)
         0 |   double __f
         0 |   unsigned long long __u
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/math.h:232:9)
         0 |   unsigned long long __m
         8 |   unsigned short __sexp
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/math.h:230:5)
         0 |   long double __ld
         0 |   struct (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/math.h:232:9) __p
         0 |     unsigned long long __m
         8 |     unsigned short __sexp
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct __float2
         0 |   float __sinval
         4 |   float __cosval
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct __double2
         0 |   double __sinval
         8 |   double __cosval
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__tuple_indices<> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__tuple_types<> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__ignore_t<unsigned char> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::tuple<> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::exception_ptr
         0 |   void * __ptr_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::nested_exception
         0 |   (nested_exception vtable pointer)
         8 |   class std::exception_ptr __ptr_
         8 |     void * __ptr_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::in_place_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::once_flag
         0 |   _State_type __state_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneRange
         0 |   int __nranges
         8 |   _RuneEntry * __ranges
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | _RuneLocale
         0 |   char[8] __magic
         8 |   char[32] __encoding
        40 |   __darwin_rune_t (*)(const char *, __darwin_size_t, const char **) __sgetrune
        48 |   int (*)(__darwin_rune_t, char *, __darwin_size_t, char **) __sputrune
        56 |   __darwin_rune_t __invalid_rune
        60 |   __uint32_t[256] __runetype
      1084 |   __darwin_rune_t[256] __maplower
      2108 |   __darwin_rune_t[256] __mapupper
      3136 |   _RuneRange __runetype_ext
      3136 |     int __nranges
      3144 |     _RuneEntry * __ranges
      3152 |   _RuneRange __maplower_ext
      3152 |     int __nranges
      3160 |     _RuneEntry * __ranges
      3168 |   _RuneRange __mapupper_ext
      3168 |     int __nranges
      3176 |     _RuneEntry * __ranges
      3184 |   void * __variable
      3192 |   int __variable_len
      3196 |   int __ncharclasses
      3200 |   _RuneCharClass * __charclasses
           | [sizeof=3208, dsize=3208, align=8,
           |  nvsize=3208, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __sbuf
         0 |   unsigned char * _base
         8 |   int _size
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __sFILE
         0 |   unsigned char * _p
         8 |   int _r
        12 |   int _w
        16 |   short _flags
        18 |   short _file
        24 |   struct __sbuf _bf
        24 |     unsigned char * _base
        32 |     int _size
        40 |   int _lbfsize
        48 |   void * _cookie
        56 |   int (* _Nullable)(void *) _close
        64 |   int (* _Nullable)(void *, char *, int) _read
        72 |   fpos_t (* _Nullable)(void *, fpos_t, int) _seek
        80 |   int (* _Nullable)(void *, const char *, int) _write
        88 |   struct __sbuf _ub
        88 |     unsigned char * _base
        96 |     int _size
       104 |   struct __sFILEX * _extra
       112 |   int _ur
       116 |   unsigned char[3] _ubuf
       119 |   unsigned char[1] _nbuf
       120 |   struct __sbuf _lb
       120 |     unsigned char * _base
       128 |     int _size
       136 |   int _blksize
       144 |   fpos_t _offset
           | [sizeof=152, dsize=152, align=8,
           |  nvsize=152, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::pmr::memory_resource
         0 |   (memory_resource vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__equal_to (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__libcpp_datasizeof<char>::_FirstPaddingByte<>
         0 |   char __v_
         1 |   char __first_padding_byte_
           | [sizeof=2, dsize=2, align=1,
           |  nvsize=2, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::input_iterator_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::forward_iterator_tag (empty)
         0 |   struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::bidirectional_iterator_tag (empty)
         0 |   struct std::forward_iterator_tag (base) (empty)
         0 |     struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::random_access_iterator_tag (empty)
         0 |   struct std::bidirectional_iterator_tag (base) (empty)
         0 |     struct std::forward_iterator_tag (base) (empty)
         0 |       struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__libcpp_datasizeof<wchar_t>::_FirstPaddingByte<>
         0 |   wchar_t __v_
         4 |   char __first_padding_byte_
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::__libcpp_datasizeof<char16_t>::_FirstPaddingByte<>
         0 |   char16_t __v_
         2 |   char __first_padding_byte_
           | [sizeof=4, dsize=4, align=2,
           |  nvsize=4, nvalign=2]

*** Dumping AST Record Layout
         0 | struct std::__libcpp_datasizeof<char32_t>::_FirstPaddingByte<>
         0 |   char32_t __v_
         4 |   char __first_padding_byte_
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | class std::__libcpp_refstring
         0 |   const char * __imp_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::logic_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
         8 |   class std::__libcpp_refstring __imp_
         8 |     const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::runtime_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
         8 |   class std::__libcpp_refstring __imp_
         8 |     const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::domain_error
         0 |   class std::logic_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     class std::__libcpp_refstring __imp_
         8 |       const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::invalid_argument
         0 |   class std::logic_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     class std::__libcpp_refstring __imp_
         8 |       const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::length_error
         0 |   class std::logic_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     class std::__libcpp_refstring __imp_
         8 |       const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::out_of_range
         0 |   class std::logic_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     class std::__libcpp_refstring __imp_
         8 |       const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::range_error
         0 |   class std::runtime_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     class std::__libcpp_refstring __imp_
         8 |       const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::overflow_error
         0 |   class std::runtime_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     class std::__libcpp_refstring __imp_
         8 |       const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::underflow_error
         0 |   class std::runtime_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     class std::__libcpp_refstring __imp_
         8 |       const char * __imp_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | std::string_view
         0 |   const value_type * __data_
         8 |   size_type __size_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | std::wstring_view
         0 |   const value_type * __data_
         8 |   size_type __size_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | std::u16string_view
         0 |   const value_type * __data_
         8 |   size_type __size_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | std::u32string_view
         0 |   const value_type * __data_
         8 |   size_type __size_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_optional_access
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::nullopt_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::nullopt_t::__secret_tag (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long, class std::ratio<3600> >
         0 |   rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long double, class std::ratio<3600> >
         0 |   rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long, class std::ratio<60> >
         0 |   rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long double, class std::ratio<60> >
         0 |   rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long long>
         0 |   rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long double>
         0 |   rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long long, class std::ratio<1, 1000> >
         0 |   rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long double, class std::ratio<1, 1000> >
         0 |   rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long long, class std::ratio<1, 1000000> >
         0 |   rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long double, class std::ratio<1, 1000000> >
         0 |   rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long long, class std::ratio<1, 1000000000> >
         0 |   rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::chrono::duration<long double, class std::ratio<1, 1000000000> >
         0 |   rep __rep_
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | class std::chrono::time_point<class std::chrono::steady_clock, class std::chrono::duration<long long, class std::ratio<1, 1000000000> > >
         0 |   class std::chrono::duration<long long, class std::ratio<1, 1000000000> > __d_
         0 |     rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::chrono::__duration_eq<class std::chrono::duration<long long, class std::ratio<1, 1000000000> >, class std::chrono::duration<long long, class std::ratio<1, 1000000000> > > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::chrono::__duration_lt<class std::chrono::duration<long long, class std::ratio<1, 1000000000> >, class std::chrono::duration<long long, class std::ratio<1, 1000000000> > > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::chrono::__duration_cast<class std::chrono::duration<long long, class std::ratio<1, 1000000000> >, class std::chrono::duration<long long> > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::chrono::__duration_cast<class std::chrono::duration<long long>, class std::chrono::duration<long long, class std::ratio<1, 1000000000> > > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutexattr_t
         0 |   long __sig
         8 |   char[8] __opaque
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_mutex_t
         0 |   long __sig
         8 |   char[56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_cond_t
         0 |   long __sig
         8 |   char[40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __darwin_time_t tv_sec
         8 |   long tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_once_t
         0 |   long __sig
         8 |   char[8] __opaque
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_attr_t
         0 |   long __sig
         8 |   char[56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _opaque_pthread_t
         0 |   long __sig
         8 |   struct __darwin_pthread_handler_rec * __cleanup_stack
        16 |   char[8176] __opaque
           | [sizeof=8192, dsize=8192, align=8,
           |  nvsize=8192, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::chrono::__duration_lt<class std::chrono::duration<long long, class std::ratio<1, 1000000> >, class std::chrono::duration<long long, class std::ratio<1, 1000000000> > > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::chrono::__duration_cast<class std::chrono::duration<long long, class std::ratio<1, 1000000> >, class std::chrono::duration<long long, class std::ratio<1, 1000000000> > > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__cxx_atomic_base_impl<_Bool>
         0 |   _Atomic(_Bool) __a_value
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__cxx_atomic_impl<_Bool>
         0 |   struct std::__cxx_atomic_base_impl<_Bool> (base)
         0 |     _Atomic(_Bool) __a_value
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::atomic_flag
         0 |   struct std::__cxx_atomic_impl<_Bool> __a_
         0 |     struct std::__cxx_atomic_base_impl<_Bool> (base)
         0 |       _Atomic(_Bool) __a_value
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::bad_variant_access
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::initializer_list<enum std::__variant_detail::_Trait>
         0 |   const enum std::__variant_detail::_Trait * __begin_
         8 |   size_t __size_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::in_place_index_t<0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__destruct_n
         0 |   size_t __size_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::plus<void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::execution::__disable_user_instantiations_tag (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::multiplies<void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::uniform_int_distribution<long>::param_type
         0 |   result_type __a_
         8 |   result_type __b_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::uniform_int_distribution<long>
         0 |   class std::uniform_int_distribution<long>::param_type __p_
         0 |     result_type __a_
         8 |     result_type __b_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__default_init_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5)
     0:0-0 |   size_type __is_long_
    0:1-63 |   size_type __cap_
           | [sizeof=8, dsize=8, align=1,
           |  nvsize=8, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::__long
         0 |   struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |     size_type __is_long_
    0:1-63 |     size_type __cap_
         8 |   size_type __size_
        16 |   pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5)
     0:0-0 |   unsigned char __is_long_
     0:1-7 |   unsigned char __size_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::__short
         0 |   struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |     unsigned char __is_long_
     0:1-7 |     unsigned char __size_
         1 |   char[0] __padding_
         1 |   value_type[23] __data_
           | [sizeof=24, dsize=24, align=1,
           |  nvsize=24, nvalign=1]

*** Dumping AST Record Layout
         0 | union std::basic_string<char>::__ulx
         0 |   struct std::basic_string<char>::__long __lx
         0 |     struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |       size_type __is_long_
    0:1-63 |       size_type __cap_
         8 |     size_type __size_
        16 |     pointer __data_
         0 |   struct std::basic_string<char>::__short __lxx
         0 |     struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |       unsigned char __is_long_
     0:1-7 |       unsigned char __size_
         1 |     char[0] __padding_
         1 |     value_type[23] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__non_trivial_if<true, class std::allocator<char> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char> (empty)
         0 |   struct std::__non_trivial_if<true, class std::allocator<char> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::__raw
         0 |   size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5)
         0 |   struct std::basic_string<char>::__short __s
         0 |     struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |       unsigned char __is_long_
     0:1-7 |       unsigned char __size_
         1 |     char[0] __padding_
         1 |     value_type[23] __data_
         0 |   struct std::basic_string<char>::__long __l
         0 |     struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |       size_type __is_long_
    0:1-63 |       size_type __cap_
         8 |     size_type __size_
        16 |     pointer __data_
         0 |   struct std::basic_string<char>::__raw __r
         0 |     size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::__rep
         0 |   union std::basic_string<char>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |     struct std::basic_string<char>::__short __s
         0 |       struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |         unsigned char __is_long_
     0:1-7 |         unsigned char __size_
         1 |       char[0] __padding_
         1 |       value_type[23] __data_
         0 |     struct std::basic_string<char>::__long __l
         0 |       struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |         size_type __is_long_
    0:1-63 |         size_type __cap_
         8 |       size_type __size_
        16 |       pointer __data_
         0 |     struct std::basic_string<char>::__raw __r
         0 |       size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<struct std::basic_string<char>::__rep, 0>
         0 |   struct std::basic_string<char>::__rep __value_
         0 |     union std::basic_string<char>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |       struct std::basic_string<char>::__short __s
         0 |         struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |           unsigned char __is_long_
     0:1-7 |           unsigned char __size_
         1 |         char[0] __padding_
         1 |         value_type[23] __data_
         0 |       struct std::basic_string<char>::__long __l
         0 |         struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |           size_type __is_long_
    0:1-63 |           size_type __cap_
         8 |         size_type __size_
        16 |         pointer __data_
         0 |       struct std::basic_string<char>::__raw __r
         0 |         size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<class std::allocator<char>, 1> (empty)
         0 |   class std::allocator<char> (base) (empty)
         0 |     struct std::__non_trivial_if<true, class std::allocator<char> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compressed_pair<struct std::basic_string<char>::__rep, class std::allocator<char> >
         0 |   struct std::__compressed_pair_elem<struct std::basic_string<char>::__rep, 0> (base)
         0 |     struct std::basic_string<char>::__rep __value_
         0 |       union std::basic_string<char>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |         struct std::basic_string<char>::__short __s
         0 |           struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |             unsigned char __is_long_
     0:1-7 |             unsigned char __size_
         1 |           char[0] __padding_
         1 |           value_type[23] __data_
         0 |         struct std::basic_string<char>::__long __l
         0 |           struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |             size_type __is_long_
    0:1-63 |             size_type __cap_
         8 |           size_type __size_
        16 |           pointer __data_
         0 |         struct std::basic_string<char>::__raw __r
         0 |           size_type[3] __words
         0 |   struct std::__compressed_pair_elem<class std::allocator<char>, 1> (base) (empty)
         0 |     class std::allocator<char> (base) (empty)
         0 |       struct std::__non_trivial_if<true, class std::allocator<char> > (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | std::string
         0 |   class std::__compressed_pair<struct std::basic_string<char>::__rep, class std::allocator<char> > __r_
         0 |     struct std::__compressed_pair_elem<struct std::basic_string<char>::__rep, 0> (base)
         0 |       struct std::basic_string<char>::__rep __value_
         0 |         union std::basic_string<char>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |           struct std::basic_string<char>::__short __s
         0 |             struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |               unsigned char __is_long_
     0:1-7 |               unsigned char __size_
         1 |             char[0] __padding_
         1 |             value_type[23] __data_
         0 |           struct std::basic_string<char>::__long __l
         0 |             struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |               size_type __is_long_
    0:1-63 |               size_type __cap_
         8 |             size_type __size_
        16 |             pointer __data_
         0 |           struct std::basic_string<char>::__raw __r
         0 |             size_type[3] __words
         0 |     struct std::__compressed_pair_elem<class std::allocator<char>, 1> (base) (empty)
         0 |       class std::allocator<char> (base) (empty)
         0 |         struct std::__non_trivial_if<true, class std::allocator<char> > (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5)
     0:0-0 |   size_type __is_long_
    0:1-63 |   size_type __cap_
           | [sizeof=8, dsize=8, align=1,
           |  nvsize=8, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::__long
         0 |   struct std::basic_string<wchar_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |     size_type __is_long_
    0:1-63 |     size_type __cap_
         8 |   size_type __size_
        16 |   pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5)
     0:0-0 |   unsigned char __is_long_
     0:1-7 |   unsigned char __size_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::__short
         0 |   struct std::basic_string<wchar_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |     unsigned char __is_long_
     0:1-7 |     unsigned char __size_
         1 |   char[3] __padding_
         4 |   value_type[5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::basic_string<wchar_t>::__ulx
         0 |   struct std::basic_string<wchar_t>::__long __lx
         0 |     struct std::basic_string<wchar_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |       size_type __is_long_
    0:1-63 |       size_type __cap_
         8 |     size_type __size_
        16 |     pointer __data_
         0 |   struct std::basic_string<wchar_t>::__short __lxx
         0 |     struct std::basic_string<wchar_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |       unsigned char __is_long_
     0:1-7 |       unsigned char __size_
         1 |     char[3] __padding_
         4 |     value_type[5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__non_trivial_if<true, class std::allocator<wchar_t> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<wchar_t> (empty)
         0 |   struct std::__non_trivial_if<true, class std::allocator<wchar_t> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::__raw
         0 |   size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<wchar_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5)
         0 |   struct std::basic_string<wchar_t>::__short __s
         0 |     struct std::basic_string<wchar_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |       unsigned char __is_long_
     0:1-7 |       unsigned char __size_
         1 |     char[3] __padding_
         4 |     value_type[5] __data_
         0 |   struct std::basic_string<wchar_t>::__long __l
         0 |     struct std::basic_string<wchar_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |       size_type __is_long_
    0:1-63 |       size_type __cap_
         8 |     size_type __size_
        16 |     pointer __data_
         0 |   struct std::basic_string<wchar_t>::__raw __r
         0 |     size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::__rep
         0 |   union std::basic_string<wchar_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |     struct std::basic_string<wchar_t>::__short __s
         0 |       struct std::basic_string<wchar_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |         unsigned char __is_long_
     0:1-7 |         unsigned char __size_
         1 |       char[3] __padding_
         4 |       value_type[5] __data_
         0 |     struct std::basic_string<wchar_t>::__long __l
         0 |       struct std::basic_string<wchar_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |         size_type __is_long_
    0:1-63 |         size_type __cap_
         8 |       size_type __size_
        16 |       pointer __data_
         0 |     struct std::basic_string<wchar_t>::__raw __r
         0 |       size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<struct std::basic_string<wchar_t>::__rep, 0>
         0 |   struct std::basic_string<wchar_t>::__rep __value_
         0 |     union std::basic_string<wchar_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |       struct std::basic_string<wchar_t>::__short __s
         0 |         struct std::basic_string<wchar_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |           unsigned char __is_long_
     0:1-7 |           unsigned char __size_
         1 |         char[3] __padding_
         4 |         value_type[5] __data_
         0 |       struct std::basic_string<wchar_t>::__long __l
         0 |         struct std::basic_string<wchar_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |           size_type __is_long_
    0:1-63 |           size_type __cap_
         8 |         size_type __size_
        16 |         pointer __data_
         0 |       struct std::basic_string<wchar_t>::__raw __r
         0 |         size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<class std::allocator<wchar_t>, 1> (empty)
         0 |   class std::allocator<wchar_t> (base) (empty)
         0 |     struct std::__non_trivial_if<true, class std::allocator<wchar_t> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compressed_pair<struct std::basic_string<wchar_t>::__rep, class std::allocator<wchar_t> >
         0 |   struct std::__compressed_pair_elem<struct std::basic_string<wchar_t>::__rep, 0> (base)
         0 |     struct std::basic_string<wchar_t>::__rep __value_
         0 |       union std::basic_string<wchar_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |         struct std::basic_string<wchar_t>::__short __s
         0 |           struct std::basic_string<wchar_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |             unsigned char __is_long_
     0:1-7 |             unsigned char __size_
         1 |           char[3] __padding_
         4 |           value_type[5] __data_
         0 |         struct std::basic_string<wchar_t>::__long __l
         0 |           struct std::basic_string<wchar_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |             size_type __is_long_
    0:1-63 |             size_type __cap_
         8 |           size_type __size_
        16 |           pointer __data_
         0 |         struct std::basic_string<wchar_t>::__raw __r
         0 |           size_type[3] __words
         0 |   struct std::__compressed_pair_elem<class std::allocator<wchar_t>, 1> (base) (empty)
         0 |     class std::allocator<wchar_t> (base) (empty)
         0 |       struct std::__non_trivial_if<true, class std::allocator<wchar_t> > (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | std::wstring
         0 |   class std::__compressed_pair<struct std::basic_string<wchar_t>::__rep, class std::allocator<wchar_t> > __r_
         0 |     struct std::__compressed_pair_elem<struct std::basic_string<wchar_t>::__rep, 0> (base)
         0 |       struct std::basic_string<wchar_t>::__rep __value_
         0 |         union std::basic_string<wchar_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |           struct std::basic_string<wchar_t>::__short __s
         0 |             struct std::basic_string<wchar_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |               unsigned char __is_long_
     0:1-7 |               unsigned char __size_
         1 |             char[3] __padding_
         4 |             value_type[5] __data_
         0 |           struct std::basic_string<wchar_t>::__long __l
         0 |             struct std::basic_string<wchar_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |               size_type __is_long_
    0:1-63 |               size_type __cap_
         8 |             size_type __size_
        16 |             pointer __data_
         0 |           struct std::basic_string<wchar_t>::__raw __r
         0 |             size_type[3] __words
         0 |     struct std::__compressed_pair_elem<class std::allocator<wchar_t>, 1> (base) (empty)
         0 |       class std::allocator<wchar_t> (base) (empty)
         0 |         struct std::__non_trivial_if<true, class std::allocator<wchar_t> > (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__init_with_sentinel_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__uninitialized_size_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5)
     0:0-0 |   size_type __is_long_
    0:1-63 |   size_type __cap_
           | [sizeof=8, dsize=8, align=1,
           |  nvsize=8, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::__long
         0 |   struct std::basic_string<char16_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |     size_type __is_long_
    0:1-63 |     size_type __cap_
         8 |   size_type __size_
        16 |   pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5)
     0:0-0 |   unsigned char __is_long_
     0:1-7 |   unsigned char __size_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::__short
         0 |   struct std::basic_string<char16_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |     unsigned char __is_long_
     0:1-7 |     unsigned char __size_
         1 |   char[1] __padding_
         2 |   value_type[11] __data_
           | [sizeof=24, dsize=24, align=2,
           |  nvsize=24, nvalign=2]

*** Dumping AST Record Layout
         0 | union std::basic_string<char16_t>::__ulx
         0 |   struct std::basic_string<char16_t>::__long __lx
         0 |     struct std::basic_string<char16_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |       size_type __is_long_
    0:1-63 |       size_type __cap_
         8 |     size_type __size_
        16 |     pointer __data_
         0 |   struct std::basic_string<char16_t>::__short __lxx
         0 |     struct std::basic_string<char16_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |       unsigned char __is_long_
     0:1-7 |       unsigned char __size_
         1 |     char[1] __padding_
         2 |     value_type[11] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__non_trivial_if<true, class std::allocator<char16_t> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char16_t> (empty)
         0 |   struct std::__non_trivial_if<true, class std::allocator<char16_t> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::__raw
         0 |   size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char16_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5)
         0 |   struct std::basic_string<char16_t>::__short __s
         0 |     struct std::basic_string<char16_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |       unsigned char __is_long_
     0:1-7 |       unsigned char __size_
         1 |     char[1] __padding_
         2 |     value_type[11] __data_
         0 |   struct std::basic_string<char16_t>::__long __l
         0 |     struct std::basic_string<char16_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |       size_type __is_long_
    0:1-63 |       size_type __cap_
         8 |     size_type __size_
        16 |     pointer __data_
         0 |   struct std::basic_string<char16_t>::__raw __r
         0 |     size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::__rep
         0 |   union std::basic_string<char16_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |     struct std::basic_string<char16_t>::__short __s
         0 |       struct std::basic_string<char16_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |         unsigned char __is_long_
     0:1-7 |         unsigned char __size_
         1 |       char[1] __padding_
         2 |       value_type[11] __data_
         0 |     struct std::basic_string<char16_t>::__long __l
         0 |       struct std::basic_string<char16_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |         size_type __is_long_
    0:1-63 |         size_type __cap_
         8 |       size_type __size_
        16 |       pointer __data_
         0 |     struct std::basic_string<char16_t>::__raw __r
         0 |       size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<struct std::basic_string<char16_t>::__rep, 0>
         0 |   struct std::basic_string<char16_t>::__rep __value_
         0 |     union std::basic_string<char16_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |       struct std::basic_string<char16_t>::__short __s
         0 |         struct std::basic_string<char16_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |           unsigned char __is_long_
     0:1-7 |           unsigned char __size_
         1 |         char[1] __padding_
         2 |         value_type[11] __data_
         0 |       struct std::basic_string<char16_t>::__long __l
         0 |         struct std::basic_string<char16_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |           size_type __is_long_
    0:1-63 |           size_type __cap_
         8 |         size_type __size_
        16 |         pointer __data_
         0 |       struct std::basic_string<char16_t>::__raw __r
         0 |         size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<class std::allocator<char16_t>, 1> (empty)
         0 |   class std::allocator<char16_t> (base) (empty)
         0 |     struct std::__non_trivial_if<true, class std::allocator<char16_t> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compressed_pair<struct std::basic_string<char16_t>::__rep, class std::allocator<char16_t> >
         0 |   struct std::__compressed_pair_elem<struct std::basic_string<char16_t>::__rep, 0> (base)
         0 |     struct std::basic_string<char16_t>::__rep __value_
         0 |       union std::basic_string<char16_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |         struct std::basic_string<char16_t>::__short __s
         0 |           struct std::basic_string<char16_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |             unsigned char __is_long_
     0:1-7 |             unsigned char __size_
         1 |           char[1] __padding_
         2 |           value_type[11] __data_
         0 |         struct std::basic_string<char16_t>::__long __l
         0 |           struct std::basic_string<char16_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |             size_type __is_long_
    0:1-63 |             size_type __cap_
         8 |           size_type __size_
        16 |           pointer __data_
         0 |         struct std::basic_string<char16_t>::__raw __r
         0 |           size_type[3] __words
         0 |   struct std::__compressed_pair_elem<class std::allocator<char16_t>, 1> (base) (empty)
         0 |     class std::allocator<char16_t> (base) (empty)
         0 |       struct std::__non_trivial_if<true, class std::allocator<char16_t> > (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | std::u16string
         0 |   class std::__compressed_pair<struct std::basic_string<char16_t>::__rep, class std::allocator<char16_t> > __r_
         0 |     struct std::__compressed_pair_elem<struct std::basic_string<char16_t>::__rep, 0> (base)
         0 |       struct std::basic_string<char16_t>::__rep __value_
         0 |         union std::basic_string<char16_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |           struct std::basic_string<char16_t>::__short __s
         0 |             struct std::basic_string<char16_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |               unsigned char __is_long_
     0:1-7 |               unsigned char __size_
         1 |             char[1] __padding_
         2 |             value_type[11] __data_
         0 |           struct std::basic_string<char16_t>::__long __l
         0 |             struct std::basic_string<char16_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |               size_type __is_long_
    0:1-63 |               size_type __cap_
         8 |             size_type __size_
        16 |             pointer __data_
         0 |           struct std::basic_string<char16_t>::__raw __r
         0 |             size_type[3] __words
         0 |     struct std::__compressed_pair_elem<class std::allocator<char16_t>, 1> (base) (empty)
         0 |       class std::allocator<char16_t> (base) (empty)
         0 |         struct std::__non_trivial_if<true, class std::allocator<char16_t> > (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5)
     0:0-0 |   size_type __is_long_
    0:1-63 |   size_type __cap_
           | [sizeof=8, dsize=8, align=1,
           |  nvsize=8, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::__long
         0 |   struct std::basic_string<char32_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |     size_type __is_long_
    0:1-63 |     size_type __cap_
         8 |   size_type __size_
        16 |   pointer __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5)
     0:0-0 |   unsigned char __is_long_
     0:1-7 |   unsigned char __size_
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::__short
         0 |   struct std::basic_string<char32_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |     unsigned char __is_long_
     0:1-7 |     unsigned char __size_
         1 |   char[3] __padding_
         4 |   value_type[5] __data_
           | [sizeof=24, dsize=24, align=4,
           |  nvsize=24, nvalign=4]

*** Dumping AST Record Layout
         0 | union std::basic_string<char32_t>::__ulx
         0 |   struct std::basic_string<char32_t>::__long __lx
         0 |     struct std::basic_string<char32_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |       size_type __is_long_
    0:1-63 |       size_type __cap_
         8 |     size_type __size_
        16 |     pointer __data_
         0 |   struct std::basic_string<char32_t>::__short __lxx
         0 |     struct std::basic_string<char32_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |       unsigned char __is_long_
     0:1-7 |       unsigned char __size_
         1 |     char[3] __padding_
         4 |     value_type[5] __data_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__non_trivial_if<true, class std::allocator<char32_t> > (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char32_t> (empty)
         0 |   struct std::__non_trivial_if<true, class std::allocator<char32_t> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::__raw
         0 |   size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char32_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5)
         0 |   struct std::basic_string<char32_t>::__short __s
         0 |     struct std::basic_string<char32_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |       unsigned char __is_long_
     0:1-7 |       unsigned char __size_
         1 |     char[3] __padding_
         4 |     value_type[5] __data_
         0 |   struct std::basic_string<char32_t>::__long __l
         0 |     struct std::basic_string<char32_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |       size_type __is_long_
    0:1-63 |       size_type __cap_
         8 |     size_type __size_
        16 |     pointer __data_
         0 |   struct std::basic_string<char32_t>::__raw __r
         0 |     size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::__rep
         0 |   union std::basic_string<char32_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |     struct std::basic_string<char32_t>::__short __s
         0 |       struct std::basic_string<char32_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |         unsigned char __is_long_
     0:1-7 |         unsigned char __size_
         1 |       char[3] __padding_
         4 |       value_type[5] __data_
         0 |     struct std::basic_string<char32_t>::__long __l
         0 |       struct std::basic_string<char32_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |         size_type __is_long_
    0:1-63 |         size_type __cap_
         8 |       size_type __size_
        16 |       pointer __data_
         0 |     struct std::basic_string<char32_t>::__raw __r
         0 |       size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<struct std::basic_string<char32_t>::__rep, 0>
         0 |   struct std::basic_string<char32_t>::__rep __value_
         0 |     union std::basic_string<char32_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |       struct std::basic_string<char32_t>::__short __s
         0 |         struct std::basic_string<char32_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |           unsigned char __is_long_
     0:1-7 |           unsigned char __size_
         1 |         char[3] __padding_
         4 |         value_type[5] __data_
         0 |       struct std::basic_string<char32_t>::__long __l
         0 |         struct std::basic_string<char32_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |           size_type __is_long_
    0:1-63 |           size_type __cap_
         8 |         size_type __size_
        16 |         pointer __data_
         0 |       struct std::basic_string<char32_t>::__raw __r
         0 |         size_type[3] __words
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<class std::allocator<char32_t>, 1> (empty)
         0 |   class std::allocator<char32_t> (base) (empty)
         0 |     struct std::__non_trivial_if<true, class std::allocator<char32_t> > (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::__compressed_pair<struct std::basic_string<char32_t>::__rep, class std::allocator<char32_t> >
         0 |   struct std::__compressed_pair_elem<struct std::basic_string<char32_t>::__rep, 0> (base)
         0 |     struct std::basic_string<char32_t>::__rep __value_
         0 |       union std::basic_string<char32_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |         struct std::basic_string<char32_t>::__short __s
         0 |           struct std::basic_string<char32_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |             unsigned char __is_long_
     0:1-7 |             unsigned char __size_
         1 |           char[3] __padding_
         4 |           value_type[5] __data_
         0 |         struct std::basic_string<char32_t>::__long __l
         0 |           struct std::basic_string<char32_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |             size_type __is_long_
    0:1-63 |             size_type __cap_
         8 |           size_type __size_
        16 |           pointer __data_
         0 |         struct std::basic_string<char32_t>::__raw __r
         0 |           size_type[3] __words
         0 |   struct std::__compressed_pair_elem<class std::allocator<char32_t>, 1> (base) (empty)
         0 |     class std::allocator<char32_t> (base) (empty)
         0 |       struct std::__non_trivial_if<true, class std::allocator<char32_t> > (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | std::u32string
         0 |   class std::__compressed_pair<struct std::basic_string<char32_t>::__rep, class std::allocator<char32_t> > __r_
         0 |     struct std::__compressed_pair_elem<struct std::basic_string<char32_t>::__rep, 0> (base)
         0 |       struct std::basic_string<char32_t>::__rep __value_
         0 |         union std::basic_string<char32_t>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
         0 |           struct std::basic_string<char32_t>::__short __s
         0 |             struct std::basic_string<char32_t>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
     0:0-0 |               unsigned char __is_long_
     0:1-7 |               unsigned char __size_
         1 |             char[3] __padding_
         4 |             value_type[5] __data_
         0 |           struct std::basic_string<char32_t>::__long __l
         0 |             struct std::basic_string<char32_t>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
     0:0-0 |               size_type __is_long_
    0:1-63 |               size_type __cap_
         8 |             size_type __size_
        16 |             pointer __data_
         0 |           struct std::basic_string<char32_t>::__raw __r
         0 |             size_type[3] __words
         0 |     struct std::__compressed_pair_elem<class std::allocator<char32_t>, 1> (base) (empty)
         0 |       class std::allocator<char32_t> (base) (empty)
         0 |         struct std::__non_trivial_if<true, class std::allocator<char32_t> > (base) (empty)
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale
         0 |   __imp * __locale_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::id
         0 |   struct std::once_flag __flag_
         0 |     _State_type __state_
         8 |   int32_t __id_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::facet
         0 |   class std::__shared_count (primary base)
         0 |     (__shared_count vtable pointer)
         8 |     long __shared_owners_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ctype_base (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::ctype<wchar_t>
         0 |   class std::locale::facet (primary base)
         0 |     class std::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::ctype_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ctype<char>
         0 |   class std::locale::facet (primary base)
         0 |     class std::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::ctype_base (base) (empty)
        16 |   const mask * __tab_
        24 |   _Bool __del_
           | [sizeof=32, dsize=25, align=8,
           |  nvsize=25, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::codecvt_base (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::codecvt<char, char, mbstate_t>
         0 |   class std::locale::facet (primary base)
         0 |     class std::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | __mbstate_t
         0 |   char[128] __mbstate8
         0 |   long long _mbstateL
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::codecvt<wchar_t, char, mbstate_t>
         0 |   class std::locale::facet (primary base)
         0 |     class std::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::codecvt_base (base) (empty)
        16 |   locale_t __l_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::codecvt<char16_t, char, mbstate_t>
         0 |   class std::locale::facet (primary base)
         0 |     class std::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::codecvt<char32_t, char, mbstate_t>
         0 |   class std::locale::facet (primary base)
         0 |     class std::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
         0 |   class std::codecvt_base (base) (empty)
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::numpunct<char>
         0 |   class std::locale::facet (primary base)
         0 |     class std::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
        16 |   char_type __decimal_point_
        17 |   char_type __thousands_sep_
        24 |   std::string __grouping_
        24 |     class std::__compressed_pair<struct std::basic_string<char>::__rep, class std::allocator<char> > __r_
        24 |       struct std::__compressed_pair_elem<struct std::basic_string<char>::__rep, 0> (base)
        24 |         struct std::basic_string<char>::__rep __value_
        24 |           union std::basic_string<char>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
        24 |             struct std::basic_string<char>::__short __s
        24 |               struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
    24:0-0 |                 unsigned char __is_long_
    24:1-7 |                 unsigned char __size_
        25 |               char[0] __padding_
        25 |               value_type[23] __data_
        24 |             struct std::basic_string<char>::__long __l
        24 |               struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
    24:0-0 |                 size_type __is_long_
   24:1-63 |                 size_type __cap_
        32 |               size_type __size_
        40 |               pointer __data_
        24 |             struct std::basic_string<char>::__raw __r
        24 |               size_type[3] __words
        24 |       struct std::__compressed_pair_elem<class std::allocator<char>, 1> (base) (empty)
        24 |         class std::allocator<char> (base) (empty)
        24 |           struct std::__non_trivial_if<true, class std::allocator<char> > (base) (empty)
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::numpunct<wchar_t>
         0 |   class std::locale::facet (primary base)
         0 |     class std::__shared_count (primary base)
         0 |       (__shared_count vtable pointer)
         8 |       long __shared_owners_
        16 |   char_type __decimal_point_
        20 |   char_type __thousands_sep_
        24 |   std::string __grouping_
        24 |     class std::__compressed_pair<struct std::basic_string<char>::__rep, class std::allocator<char> > __r_
        24 |       struct std::__compressed_pair_elem<struct std::basic_string<char>::__rep, 0> (base)
        24 |         struct std::basic_string<char>::__rep __value_
        24 |           union std::basic_string<char>::__rep::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:833:5) 
        24 |             struct std::basic_string<char>::__short __s
        24 |               struct std::basic_string<char>::__short::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:809:5) 
    24:0-0 |                 unsigned char __is_long_
    24:1-7 |                 unsigned char __size_
        25 |               char[0] __padding_
        25 |               value_type[23] __data_
        24 |             struct std::basic_string<char>::__long __l
        24 |               struct std::basic_string<char>::__long::(anonymous at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/string:798:5) 
    24:0-0 |                 size_type __is_long_
   24:1-63 |                 size_type __cap_
        32 |               size_type __size_
        40 |               pointer __data_
        24 |             struct std::basic_string<char>::__raw __r
        24 |               size_type[3] __words
        24 |       struct std::__compressed_pair_elem<class std::allocator<char>, 1> (base) (empty)
        24 |         class std::allocator<char> (base) (empty)
        24 |           struct std::__non_trivial_if<true, class std::allocator<char> > (base) (empty)
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::error_category
         0 |   (error_category vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__do_message
         0 |   class std::error_category (primary base)
         0 |     (error_category vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::error_condition
         0 |   int __val_
         8 |   const error_category * __cat_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::error_code
         0 |   int __val_
         8 |   const error_category * __cat_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::system_error
         0 |   class std::runtime_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     class std::__libcpp_refstring __imp_
         8 |       const char * __imp_
        16 |   class std::error_code __ec_
        16 |     int __val_
        24 |     const error_category * __cat_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base
         0 |   (ios_base vtable pointer)
         8 |   fmtflags __fmtflags_
        16 |   streamsize __precision_
        24 |   streamsize __width_
        32 |   iostate __rdstate_
        36 |   iostate __exceptions_
        40 |   void * __rdbuf_
        48 |   void * __loc_
        56 |   event_callback * __fn_
        64 |   int * __index_
        72 |   size_t __event_size_
        80 |   size_t __event_cap_
        88 |   long * __iarray_
        96 |   size_t __iarray_size_
       104 |   size_t __iarray_cap_
       112 |   void ** __parray_
       120 |   size_t __parray_size_
       128 |   size_t __parray_cap_
           | [sizeof=136, dsize=136, align=8,
           |  nvsize=136, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base::failure
         0 |   class std::system_error (primary base)
         0 |     class std::runtime_error (primary base)
         0 |       class std::exception (primary base)
         0 |         (exception vtable pointer)
         8 |       class std::__libcpp_refstring __imp_
         8 |         const char * __imp_
        16 |     class std::error_code __ec_
        16 |       int __val_
        24 |       const error_category * __cat_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::mutex
         0 |   struct _opaque_pthread_mutex_t __m_
         0 |     long __sig
         8 |     char[56] __opaque
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::defer_lock_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::try_to_lock_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::adopt_lock_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::condition_variable
         0 |   struct _opaque_pthread_cond_t __cv_
         0 |     long __sig
         8 |     char[40] __opaque
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::chrono::time_point<class std::chrono::system_clock>
         0 |   class std::chrono::duration<long long, class std::ratio<1, 1000000> > __d_
         0 |     rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::chrono::time_point<class std::chrono::system_clock, class std::chrono::duration<long long, class std::ratio<1, 1000000000> > >
         0 |   class std::chrono::duration<long long, class std::ratio<1, 1000000000> > __d_
         0 |     rep __rep_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__thread_id
         0 |   __libcpp_thread_id __id_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::unique_lock<class std::mutex>
         0 |   mutex_type * __m_
         8 |   _Bool __owns_
           | [sizeof=16, dsize=9, align=8,
           |  nvsize=9, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__bit_reference<class std::__bitset<0, 0> >
         0 |   __storage_pointer __seg_
         8 |   __storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__bit_const_reference<class std::__bitset<0, 0> >
         0 |   __storage_pointer __seg_
         8 |   __storage_type __mask_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__bit_iterator<class std::__bitset<0, 0>, false>
         0 |   __storage_pointer __seg_
         8 |   unsigned int __ctz_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__bit_iterator<class std::__bitset<0, 0>, true>
         0 |   __storage_pointer __seg_
         8 |   unsigned int __ctz_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__bitset<0, 0> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<unsigned char *, 0>
         0 |   unsigned char * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<void (*)(void *), 1>
         0 |   void (*)(void *) __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__compressed_pair<unsigned char *, void (*)(void *)>
         0 |   struct std::__compressed_pair_elem<unsigned char *, 0> (base)
         0 |     unsigned char * __value_
         8 |   struct std::__compressed_pair_elem<void (*)(void *), 1> (base)
         8 |     void (*)(void *) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::unique_ptr<unsigned char, void (*)(void *)>
         0 |   class std::__compressed_pair<unsigned char *, void (*)(void *)> __ptr_
         0 |     struct std::__compressed_pair_elem<unsigned char *, 0> (base)
         0 |       unsigned char * __value_
         8 |     struct std::__compressed_pair_elem<void (*)(void *), 1> (base)
         8 |       void (*)(void *) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<char *, 0>
         0 |   char * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__compressed_pair<char *, void (*)(void *)>
         0 |   struct std::__compressed_pair_elem<char *, 0> (base)
         0 |     char * __value_
         8 |   struct std::__compressed_pair_elem<void (*)(void *), 1> (base)
         8 |     void (*)(void *) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::unique_ptr<char, void (*)(void *)>
         0 |   class std::__compressed_pair<char *, void (*)(void *)> __ptr_
         0 |     struct std::__compressed_pair_elem<char *, 0> (base)
         0 |       char * __value_
         8 |     struct std::__compressed_pair_elem<void (*)(void *), 1> (base)
         8 |       void (*)(void *) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__time_put
         0 |   locale_t __loc_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::money_base::pattern
         0 |   char[4] field
           | [sizeof=4, dsize=4, align=1,
           |  nvsize=4, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<unsigned int *, 0>
         0 |   unsigned int * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__compressed_pair<unsigned int *, void (*)(void *)>
         0 |   struct std::__compressed_pair_elem<unsigned int *, 0> (base)
         0 |     unsigned int * __value_
         8 |   struct std::__compressed_pair_elem<void (*)(void *), 1> (base)
         8 |     void (*)(void *) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::unique_ptr<unsigned int, void (*)(void *)>
         0 |   class std::__compressed_pair<unsigned int *, void (*)(void *)> __ptr_
         0 |     struct std::__compressed_pair_elem<unsigned int *, 0> (base)
         0 |       unsigned int * __value_
         8 |     struct std::__compressed_pair_elem<void (*)(void *), 1> (base)
         8 |       void (*)(void *) __value_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | std::streambuf
         0 |   (basic_streambuf vtable pointer)
         8 |   class std::locale __loc_
         8 |     __imp * __locale_
        16 |   char_type * __binp_
        24 |   char_type * __ninp_
        32 |   char_type * __einp_
        40 |   char_type * __bout_
        48 |   char_type * __nout_
        56 |   char_type * __eout_
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::initializer_list<_Bool>
         0 |   const _Bool * __begin_
         8 |   size_t __size_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__builtin_new_allocator::__builtin_new_deleter
         0 |   size_t __size_
         8 |   size_t __align_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<void *, 0>
         0 |   void * __value_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__compressed_pair_elem<struct std::__builtin_new_allocator::__builtin_new_deleter, 1>
         0 |   struct std::__builtin_new_allocator::__builtin_new_deleter __value_
         0 |     size_t __size_
         8 |     size_t __align_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__compressed_pair<void *, struct std::__builtin_new_allocator::__builtin_new_deleter>
         0 |   struct std::__compressed_pair_elem<void *, 0> (base)
         0 |     void * __value_
         8 |   struct std::__compressed_pair_elem<struct std::__builtin_new_allocator::__builtin_new_deleter, 1> (base)
         8 |     struct std::__builtin_new_allocator::__builtin_new_deleter __value_
         8 |       size_t __size_
        16 |       size_t __align_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::unique_ptr<void, struct std::__builtin_new_allocator::__builtin_new_deleter>
         0 |   class std::__compressed_pair<void *, struct std::__builtin_new_allocator::__builtin_new_deleter> __ptr_
         0 |     struct std::__compressed_pair_elem<void *, 0> (base)
         0 |       void * __value_
         8 |     struct std::__compressed_pair_elem<struct std::__builtin_new_allocator::__builtin_new_deleter, 1> (base)
         8 |       struct std::__builtin_new_allocator::__builtin_new_deleter __value_
         8 |         size_t __size_
        16 |         size_t __align_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_function_call
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__struct_double
         0 |   long double __lx
           | [sizeof=16, dsize=16, align=16,
           |  nvsize=16, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__struct_double4
         0 |   double[4] __lx
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::aligned_storage<24>::type
         0 |   unsigned char[32] __lx
           | [sizeof=32, dsize=32, align=16,
           |  nvsize=32, nvalign=16]

*** Dumping AST Record Layout
         0 | struct std::__function::__policy
         0 |   void *(*const)(const void *) __clone
         8 |   void (*const)(void *) __destroy
        16 |   const _Bool __is_null
        24 |   const std::type_info *const __type_info
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class Parent
         0 |   (Parent vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class Derived
         0 |   class Parent (primary base)
         0 |     (Parent vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | std::ios
         0 |   class std::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     fmtflags __fmtflags_
        16 |     streamsize __precision_
        24 |     streamsize __width_
        32 |     iostate __rdstate_
        36 |     iostate __exceptions_
        40 |     void * __rdbuf_
        48 |     void * __loc_
        56 |     event_callback * __fn_
        64 |     int * __index_
        72 |     size_t __event_size_
        80 |     size_t __event_cap_
        88 |     long * __iarray_
        96 |     size_t __iarray_size_
       104 |     size_t __iarray_cap_
       112 |     void ** __parray_
       120 |     size_t __parray_size_
       128 |     size_t __parray_cap_
       136 |   basic_ostream<char_type, traits_type> * __tie_
       144 |   int_type __fill_
           | [sizeof=152, dsize=148, align=8,
           |  nvsize=148, nvalign=8]

*** Dumping AST Record Layout
         0 | std::ostream
         0 |   (basic_ostream vtable pointer)
         8 |   std::ios (virtual base)
         8 |     class std::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       fmtflags __fmtflags_
        24 |       streamsize __precision_
        32 |       streamsize __width_
        40 |       iostate __rdstate_
        44 |       iostate __exceptions_
        48 |       void * __rdbuf_
        56 |       void * __loc_
        64 |       event_callback * __fn_
        72 |       int * __index_
        80 |       size_t __event_size_
        88 |       size_t __event_cap_
        96 |       long * __iarray_
       104 |       size_t __iarray_size_
       112 |       size_t __iarray_cap_
       120 |       void ** __parray_
       128 |       size_t __parray_size_
       136 |       size_t __parray_cap_
       144 |     basic_ostream<char_type, traits_type> * __tie_
       152 |     int_type __fill_
           | [sizeof=160, dsize=156, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x7fe0777f17a0[0m <[0;33mmain.cpp:3:1[0m, [0;33mline:7:1[0m> [0;33mline:3:7[0m referenced class[0;1;36m Parent[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic literal has_constexpr_non_copy_move_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial constexpr defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple non_trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple non_trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe0777f18b8[0m <[0;33mcol:1[0m, [0;33mcol:7[0m> [0;33mcol:7[0m implicit class[0;1;36m Parent[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe0777f1948[0m <[0;33mline:4:2[0m, [0;33mcol:8[0m> [0;33mcol:2[0m public
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777f19c0[0m <[0;33mline:5:3[0m, [0;33mcol:23[0m> [0;33mcol:16[0m[0;1;36m Foo[0m [0;32m'void ()'[0m virtual implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe0777f2090[0m <[0;33mcol:22[0m, [0;33mcol:23[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777f1a88[0m <[0;33mline:6:3[0m, [0;33mcol:36[0m> [0;33mcol:16[0m[0;1;36m FooNotOverridden[0m [0;32m'void ()'[0m virtual implicit-inline
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe0777f20a0[0m <[0;33mcol:35[0m, [0;33mcol:36[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777f1c18[0m <[0;33mline:3:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m operator=[0m [0;32m'Parent &(const Parent &)'[0m inline default noexcept-unevaluated 0x7fe0777f1c18
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777f1d28[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const Parent &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777f1df8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m operator=[0m [0;32m'Parent &(Parent &&)'[0m inline default noexcept-unevaluated 0x7fe0777f1df8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777f1f08[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'Parent &&'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x7fe0777f1fa0[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m ~Parent[0m [0;32m'void ()'[0m inline default trivial noexcept-unevaluated 0x7fe0777f1fa0
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe0777f2ae0[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit used constexpr[0;1;36m Parent[0m [0;32m'void () noexcept'[0m inline default
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe0777f2ff0[0m <[0;33mcol:7[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe0777f2bc0[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m Parent[0m [0;32m'void (const Parent &)'[0m inline default noexcept-unevaluated 0x7fe0777f2bc0
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777f2cd8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const Parent &'[0m
[0;34m`-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe0777f2d58[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m Parent[0m [0;32m'void (Parent &&)'[0m inline default noexcept-unevaluated 0x7fe0777f2d58
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777f2e78[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'Parent &&'[0m

Layout: <CGRecordLayout
  LLVMType:%class.Parent = type { ptr }
  NonVirtualBaseLLVMType:%class.Parent = type { ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x7fe0777f20b0[0m <[0;33mmain.cpp:9:1[0m, [0;33mline:12:1[0m> [0;33mline:9:7[0m referenced class[0;1;36m Derived[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic literal has_constexpr_non_copy_move_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial constexpr defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple non_trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple non_trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m|-[0mpublic [0;32m'Parent':'Parent'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe0777f2208[0m <[0;33mcol:1[0m, [0;33mcol:7[0m> [0;33mcol:7[0m implicit class[0;1;36m Derived[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe0777f2298[0m <[0;33mline:10:2[0m, [0;33mcol:8[0m> [0;33mcol:2[0m public
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777f2310[0m <[0;33mline:11:3[0m, [0;33mcol:24[0m> [0;33mcol:8[0m[0;1;36m Foo[0m [0;32m'void ()'[0m implicit-inline
[0;34m| |-[0mOverrides: [ 0x7fe0777f19c0 Parent::Foo 'void ()' ]
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe0777f2970[0m <[0;33mcol:23[0m, [0;33mcol:24[0m>
[0;34m| `-[0m[0;1;34mOverrideAttr[0m[0;33m 0x7fe0777f23b8[0m <[0;33mcol:14[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777f24f8[0m <[0;33mline:9:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m operator=[0m [0;32m'Derived &(const Derived &)'[0m inline default noexcept-unevaluated 0x7fe0777f24f8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777f2608[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const Derived &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777f26d8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m operator=[0m [0;32m'Derived &(Derived &&)'[0m inline default noexcept-unevaluated 0x7fe0777f26d8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777f27e8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'Derived &&'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x7fe0777f2880[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m ~Derived[0m [0;32m'void ()'[0m inline default trivial noexcept-unevaluated 0x7fe0777f2880
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe0777f3188[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit used constexpr[0;1;36m Derived[0m [0;32m'void () noexcept'[0m inline default
[0;34m| |-[0mCXXCtorInitializer [0;32m'Parent':'Parent'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x7fe0777f36a0[0m <[0;33mcol:7[0m> [0;32m'Parent':'Parent'[0m[0;36m[0m[0;36m[0m [0;32m'void () noexcept'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe0777f3700[0m <[0;33mcol:7[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe0777f3270[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m Derived[0m [0;32m'void (const Derived &)'[0m inline default noexcept-unevaluated 0x7fe0777f3270
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777f3388[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const Derived &'[0m
[0;34m`-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe0777f3408[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m Derived[0m [0;32m'void (Derived &&)'[0m inline default noexcept-unevaluated 0x7fe0777f3408
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777f3528[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'Derived &&'[0m

Layout: <CGRecordLayout
  LLVMType:%class.Derived = type { %class.Parent }
  NonVirtualBaseLLVMType:%class.Derived = type { %class.Parent }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x7fe075f3f3e8[0m prev 0x7fe070d87450 <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:252:1[0m, [0;33mline:407:1[0m> [0;33mline:252:33[0m referenced class[0;1;36m ios_base[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f3f4e0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Default
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe075f3f538[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:252:1[0m, [0;33mcol:33[0m> [0;33mcol:33[0m implicit referenced class[0;1;36m ios_base[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe075f3f5c8[0m <[0;33mline:253:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe075f3f610[0m <[0;33mline:254:3[0m, [0;33mcol:35[0m> [0;33mcol:35[0m class[0;1;36m failure[0m
[0;34m| `-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f3f6c0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Default
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f3f730[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:256:3[0m, [0;33mcol:24[0m> [0;33mcol:24[0m referenced[0;1;36m fmtflags[0m [0;32m'unsigned int'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe0730229b0[0m [0;32m'unsigned int'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f3f800[0m <[0;33mline:257:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m boolalpha[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f3f888[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f3f868[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f3f908[0m <[0;33mline:258:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m dec[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f3f990[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f3f970[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 2[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f3fa10[0m <[0;33mline:259:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m fixed[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f3fa98[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f3fa78[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 4[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f3fb18[0m <[0;33mline:260:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m hex[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f3fba0[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f3fb80[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 8[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f3fc20[0m <[0;33mline:261:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m internal[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f3fca8[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f3fc88[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 16[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f3fd28[0m <[0;33mline:262:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m left[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f3fdb0[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f3fd90[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 32[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f3fe30[0m <[0;33mline:263:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m oct[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f3feb8[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f3fe98[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 64[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f3ff38[0m <[0;33mline:264:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m right[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f3ffc0[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f3ffa0[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 128[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40040[0m <[0;33mline:265:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m scientific[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f400c8[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f400a8[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 256[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40148[0m <[0;33mline:266:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m showbase[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f401d0[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f401b0[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 512[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40250[0m <[0;33mline:267:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m showpoint[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f402d8[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f402b8[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1024[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40358[0m <[0;33mline:268:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m showpos[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f403e0[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f403c0[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 2048[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40460[0m <[0;33mline:269:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m skipws[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f404e8[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f404c8[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 4096[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40568[0m <[0;33mline:270:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m unitbuf[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f405f0[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f405d0[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 8192[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40670[0m <[0;33mline:271:3[0m, [0;33mcol:39[0m> [0;33mcol:25[0m referenced[0;1;36m uppercase[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f406f8[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f406d8[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 16384[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40778[0m <[0;33mline:272:3[0m, [0;33mcol:54[0m> [0;33mcol:25[0m referenced[0;1;36m adjustfield[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x7fe075f40908[0m <[0;33mcol:39[0m, [0;33mcol:54[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x7fe075f40890[0m <[0;33mcol:39[0m, [0;33mcol:46[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40840[0m <[0;33mcol:39[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f40820[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f3fd28[0m[0;1;36m 'left'[0m [0;32m'const fmtflags':'const unsigned int'[0m non_odr_use_constant
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40878[0m <[0;33mcol:46[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f40858[0m <[0;33mcol:46[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f3ff38[0m[0;1;36m 'right'[0m [0;32m'const fmtflags':'const unsigned int'[0m non_odr_use_constant
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f408f0[0m <[0;33mcol:54[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f408d0[0m <[0;33mcol:54[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f3fc20[0m[0;1;36m 'internal'[0m [0;32m'const fmtflags':'const unsigned int'[0m non_odr_use_constant
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40990[0m <[0;33mline:273:3[0m, [0;33mcol:51[0m> [0;33mcol:25[0m referenced[0;1;36m basefield[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x7fe075f40b20[0m <[0;33mcol:39[0m, [0;33mcol:51[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x7fe075f40aa8[0m <[0;33mcol:39[0m, [0;33mcol:45[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40a58[0m <[0;33mcol:39[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f40a38[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f3f908[0m[0;1;36m 'dec'[0m [0;32m'const fmtflags':'const unsigned int'[0m non_odr_use_constant
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40a90[0m <[0;33mcol:45[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f40a70[0m <[0;33mcol:45[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f3fe30[0m[0;1;36m 'oct'[0m [0;32m'const fmtflags':'const unsigned int'[0m non_odr_use_constant
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40b08[0m <[0;33mcol:51[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f40ae8[0m <[0;33mcol:51[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f3fb18[0m[0;1;36m 'hex'[0m [0;32m'const fmtflags':'const unsigned int'[0m non_odr_use_constant
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40ba8[0m <[0;33mline:274:3[0m, [0;33mcol:52[0m> [0;33mcol:25[0m referenced[0;1;36m floatfield[0m [0;32m'const fmtflags':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x7fe075f40cc0[0m <[0;33mcol:39[0m, [0;33mcol:52[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|   |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40c70[0m <[0;33mcol:39[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f40c50[0m <[0;33mcol:39[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f40040[0m[0;1;36m 'scientific'[0m [0;32m'const fmtflags':'const unsigned int'[0m non_odr_use_constant
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40ca8[0m <[0;33mcol:52[0m> [0;32m'fmtflags':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f40c88[0m <[0;33mcol:52[0m> [0;32m'const fmtflags':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f3fa10[0m[0;1;36m 'fixed'[0m [0;32m'const fmtflags':'const unsigned int'[0m non_odr_use_constant
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f40d50[0m <[0;33mline:276:3[0m, [0;33mcol:24[0m> [0;33mcol:24[0m referenced[0;1;36m iostate[0m [0;32m'unsigned int'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe0730229b0[0m [0;32m'unsigned int'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40e20[0m <[0;33mline:277:3[0m, [0;33mcol:34[0m> [0;33mcol:24[0m referenced[0;1;36m badbit[0m [0;32m'const iostate':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40ea8[0m <[0;33mcol:34[0m> [0;32m'const iostate':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f40e88[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f40f28[0m <[0;33mline:278:3[0m, [0;33mcol:34[0m> [0;33mcol:24[0m referenced[0;1;36m eofbit[0m [0;32m'const iostate':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f40fb0[0m <[0;33mcol:34[0m> [0;32m'const iostate':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f40f90[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 2[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f41030[0m <[0;33mline:279:3[0m, [0;33mcol:34[0m> [0;33mcol:24[0m referenced[0;1;36m failbit[0m [0;32m'const iostate':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f410b8[0m <[0;33mcol:34[0m> [0;32m'const iostate':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f41098[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 4[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f41138[0m <[0;33mline:280:3[0m, [0;33mcol:34[0m> [0;33mcol:24[0m referenced[0;1;36m goodbit[0m [0;32m'const iostate':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f411c0[0m <[0;33mcol:34[0m> [0;32m'const iostate':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f411a0[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f41248[0m <[0;33mline:282:3[0m, [0;33mcol:24[0m> [0;33mcol:24[0m referenced[0;1;36m openmode[0m [0;32m'unsigned int'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe0730229b0[0m [0;32m'unsigned int'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f41310[0m <[0;33mline:283:3[0m, [0;33mcol:34[0m> [0;33mcol:25[0m[0;1;36m app[0m [0;32m'const openmode':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f41398[0m <[0;33mcol:34[0m> [0;32m'const openmode':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f41378[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f41418[0m <[0;33mline:284:3[0m, [0;33mcol:34[0m> [0;33mcol:25[0m[0;1;36m ate[0m [0;32m'const openmode':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f414a0[0m <[0;33mcol:34[0m> [0;32m'const openmode':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f41480[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 2[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f41520[0m <[0;33mline:285:3[0m, [0;33mcol:34[0m> [0;33mcol:25[0m[0;1;36m binary[0m [0;32m'const openmode':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f415a8[0m <[0;33mcol:34[0m> [0;32m'const openmode':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f41588[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 4[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f41628[0m <[0;33mline:286:3[0m, [0;33mcol:34[0m> [0;33mcol:25[0m referenced[0;1;36m in[0m [0;32m'const openmode':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f416b0[0m <[0;33mcol:34[0m> [0;32m'const openmode':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f41690[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 8[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f41730[0m <[0;33mline:287:3[0m, [0;33mcol:34[0m> [0;33mcol:25[0m referenced[0;1;36m out[0m [0;32m'const openmode':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f417b8[0m <[0;33mcol:34[0m> [0;32m'const openmode':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f41798[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 16[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f41838[0m <[0;33mline:288:3[0m, [0;33mcol:34[0m> [0;33mcol:25[0m[0;1;36m trunc[0m [0;32m'const openmode':'const unsigned int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f418c0[0m <[0;33mcol:34[0m> [0;32m'const openmode':'const unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x7fe075f418a0[0m <[0;33mcol:34[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 32[0m
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x7fe075f41930[0m <[0;33mline:293:3[0m, [0;33mcol:32[0m> [0;33mcol:8[0m referenced[0;1;36m seekdir[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x7fe075f419f0[0m <[0;33mcol:18[0m> [0;33mcol:18[0m referenced[0;1;36m beg[0m [0;32m'std::ios_base::seekdir'[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x7fe075f41a40[0m <[0;33mcol:23[0m> [0;33mcol:23[0m referenced[0;1;36m cur[0m [0;32m'std::ios_base::seekdir'[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x7fe075f41a90[0m <[0;33mcol:28[0m> [0;33mcol:28[0m referenced[0;1;36m end[0m [0;32m'std::ios_base::seekdir'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe075f41b00[0m <[0;33mline:304:3[0m, [0;33mcol:35[0m> [0;33mcol:35[0m class[0;1;36m Init[0m
[0;34m| `-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f41bb0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Default
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f41cf8[0m <[0;33mcol:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:307:42[0m> [0;33mcol:34[0m[0;1;36m flags[0m [0;32m'fmtflags () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f41da0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f41df8[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f41e20[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f41fa8[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:308:56[0m> [0;33mcol:34[0m[0;1;36m flags[0m [0;32m'fmtflags (fmtflags)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f41eb8[0m <[0;33mcol:40[0m, [0;33mcol:49[0m> [0;33mcol:49[0m[0;1;36m __fmtfl[0m [0;32m'fmtflags':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f42058[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f420b0[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f420d8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f42218[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:309:55[0m> [0;33mcol:34[0m used[0;1;36m setf[0m [0;32m'fmtflags (fmtflags)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f42188[0m <[0;33mcol:39[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __fmtfl[0m [0;32m'fmtflags':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f422c8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f42320[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f42348[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f42578[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:310:72[0m> [0;33mcol:34[0m used[0;1;36m setf[0m [0;32m'fmtflags (fmtflags, fmtflags)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f423e8[0m <[0;33mcol:39[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __fmtfl[0m [0;32m'fmtflags':'unsigned int'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f42460[0m <[0;33mcol:57[0m, [0;33mcol:66[0m> [0;33mcol:66[0m[0;1;36m __mask[0m [0;32m'fmtflags':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f42630[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f42688[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f426b0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f42818[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:311:52[0m> [0;33mcol:30[0m used[0;1;36m unsetf[0m [0;32m'void (fmtflags)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f42758[0m <[0;33mcol:37[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __mask[0m [0;32m'fmtflags':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f428c8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f42920[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f42948[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f42a88[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:313:48[0m> [0;33mcol:36[0m[0;1;36m precision[0m [0;32m'streamsize () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f42b30[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f42b88[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f42bb0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f42d08[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:314:63[0m> [0;33mcol:36[0m[0;1;36m precision[0m [0;32m'streamsize (streamsize)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f42c48[0m <[0;33mcol:46[0m, [0;33mcol:57[0m> [0;33mcol:57[0m[0;1;36m __prec[0m [0;32m'streamsize':'long'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f42db8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f42e10[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f42e38[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f42ef8[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:315:44[0m> [0;33mcol:36[0m[0;1;36m width[0m [0;32m'streamsize () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f42fa0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f42ff8[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f43020[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f43148[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:316:59[0m> [0;33mcol:36[0m[0;1;36m width[0m [0;32m'streamsize (streamsize)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f430b8[0m <[0;33mcol:42[0m, [0;33mcol:53[0m> [0;33mcol:53[0m[0;1;36m __wide[0m [0;32m'streamsize':'long'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f431f8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f43250[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f43278[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f43380[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:319:3[0m, [0;33mcol:35[0m> [0;33mcol:10[0m referenced[0;1;36m imbue[0m [0;32m'locale (const locale &)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f432f0[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f434a8[0m <[0;33mline:320:3[0m, [0;33mcol:19[0m> [0;33mcol:10[0m referenced[0;1;36m getloc[0m [0;32m'locale () const'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f43578[0m <[0;33mline:323:3[0m, [0;33mcol:21[0m> [0;33mcol:14[0m[0;1;36m xalloc[0m [0;32m'int ()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f43700[0m <[0;33mline:324:3[0m, [0;33mcol:26[0m> [0;33mcol:9[0m[0;1;36m iword[0m [0;32m'long &(int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f43638[0m <[0;33mcol:15[0m, [0;33mcol:19[0m> [0;33mcol:19[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f43890[0m <[0;33mline:325:3[0m, [0;33mcol:27[0m> [0;33mcol:10[0m[0;1;36m pword[0m [0;32m'void *&(int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f437c8[0m <[0;33mcol:16[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x7fe075f43988[0m <[0;33mline:328:3[0m, [0;33mcol:21[0m> [0;33mcol:11[0m[0;1;36m ~ios_base[0m [0;32m'void () noexcept'[0m virtual
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x7fe075f43a70[0m <[0;33mline:331:3[0m, [0;33mcol:56[0m> [0;33mcol:8[0m referenced[0;1;36m event[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x7fe075f43b30[0m <[0;33mcol:16[0m> [0;33mcol:16[0m referenced[0;1;36m erase_event[0m [0;32m'std::ios_base::event'[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x7fe075f43b80[0m <[0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m imbue_event[0m [0;32m'std::ios_base::event'[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x7fe075f43bd0[0m <[0;33mcol:42[0m> [0;33mcol:42[0m referenced[0;1;36m copyfmt_event[0m [0;32m'std::ios_base::event'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f43f28[0m <[0;33mline:332:3[0m, [0;33mcol:63[0m> [0;33mcol:18[0m referenced[0;1;36m event_callback[0m [0;32m'void (*)(event, ios_base &, int)'[0m
[0;34m| `-[0m[0;32mPointerType[0m[0;33m 0x7fe075f43eb0[0m [0;32m'void (*)(event, ios_base &, int)'[0m
[0;34m|   `-[0m[0;32mParenType[0m[0;33m 0x7fe075f43e50[0m [0;32m'void (event, ios_base &, int)'[0m sugar
[0;34m|     `-[0m[0;32mFunctionProtoType[0m[0;33m 0x7fe075f43e10[0m [0;32m'void (event, ios_base &, int)'[0m cdecl
[0;34m|       |-[0m[0;32mBuiltinType[0m[0;33m 0x7fe073022870[0m [0;32m'void'[0m
[0;34m|       |-[0m[0;32mElaboratedType[0m[0;33m 0x7fe075f43c20[0m [0;32m'event'[0m sugar
[0;34m|       | `-[0m[0;32mEnumType[0m[0;33m 0x7fe075f43b10[0m [0;32m'std::ios_base::event'[0m
[0;34m|       |   `-[0m[0;1;32mEnum[0m[0;33m 0x7fe075f43a70[0m[0;1;36m 'event'[0m
[0;34m|       |-[0m[0;32mLValueReferenceType[0m[0;33m 0x7fe075935c00[0m [0;32m'ios_base &'[0m
[0;34m|       | `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe075935ba0[0m [0;32m'ios_base'[0m sugar
[0;34m|       |   `-[0m[0;32mRecordType[0m[0;33m 0x7fe070d874e0[0m [0;32m'std::ios_base'[0m
[0;34m|       |     `-[0m[0;1;32mCXXRecord[0m[0;33m 0x7fe075f3f3e8[0m[0;1;36m 'ios_base'[0m
[0;34m|       `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe073022910[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f44188[0m <[0;33mline:333:3[0m, [0;33mcol:58[0m> [0;33mcol:8[0m[0;1;36m register_callback[0m [0;32m'void (event_callback, int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f43ff0[0m <[0;33mcol:26[0m, [0;33mcol:41[0m> [0;33mcol:41[0m[0;1;36m __fn[0m [0;32m'event_callback':'void (*)(event, ios_base &, int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f44070[0m <[0;33mcol:47[0m, [0;33mcol:51[0m> [0;33mcol:51[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe075f443b8[0m <[0;33mline:335:3[0m, [0;33mcol:47[0m> [0;33mcol:3[0m[0;1;36m ios_base[0m [0;32m'void (const ios_base &)'[0m delete implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f442b0[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:27[0m [0;32m'const ios_base &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f44580[0m <[0;33mline:336:3[0m, [0;33mcol:47[0m> [0;33mcol:13[0m[0;1;36m operator=[0m [0;32m'ios_base &(const ios_base &)'[0m delete implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f44488[0m <[0;33mcol:23[0m, [0;33mcol:37[0m> [0;33mcol:38[0m [0;32m'const ios_base &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f44708[0m <[0;33mline:338:3[0m, [0;33mcol:49[0m> [0;33mcol:15[0m[0;1;36m sync_with_stdio[0m [0;32m'bool (bool)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f44640[0m <[0;33mcol:31[0m, [0;33mcol:45[0m> [0;33mcol:36[0m[0;1;36m __sync[0m [0;32m'bool'[0m cinit
[0;34m|   `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x7fe075f47870[0m <[0;33mcol:45[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f44848[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:340:43[0m> [0;33mcol:33[0m[0;1;36m rdstate[0m [0;32m'iostate () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f448f0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f44948[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f44970[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f44a88[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:341:3[0m, [0;33mcol:39[0m> [0;33mcol:8[0m used[0;1;36m clear[0m [0;32m'void (iostate)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f449c8[0m <[0;33mcol:14[0m, [0;33mcol:32[0m> [0;33mcol:22[0m[0;1;36m __state[0m [0;32m'iostate':'unsigned int'[0m cinit
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f478c0[0m <[0;33mcol:32[0m> [0;32m'iostate':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f478a0[0m <[0;33mcol:32[0m> [0;32m'const iostate':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f41138[0m[0;1;36m 'goodbit'[0m [0;32m'const iostate':'const unsigned int'[0m non_odr_use_constant
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f44c18[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:342:54[0m> [0;33mcol:30[0m[0;1;36m setstate[0m [0;32m'void (iostate)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f44b88[0m <[0;33mcol:39[0m, [0;33mcol:47[0m> [0;33mcol:47[0m[0;1;36m __state[0m [0;32m'iostate':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f44cc8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f44d20[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f44d48[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f44df8[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:344:37[0m> [0;33mcol:30[0m[0;1;36m good[0m [0;32m'bool () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f44ea0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f44ef8[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f44f20[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f44fc8[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:345:36[0m> [0;33mcol:30[0m[0;1;36m eof[0m [0;32m'bool () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f45070[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f450c8[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f450f0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f45198[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:346:37[0m> [0;33mcol:30[0m[0;1;36m fail[0m [0;32m'bool () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f45240[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f45298[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f452c0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f45368[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:347:36[0m> [0;33mcol:30[0m[0;1;36m bad[0m [0;32m'bool () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f45410[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f45468[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f45490[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f45538[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:349:46[0m> [0;33mcol:33[0m[0;1;36m exceptions[0m [0;32m'iostate () const'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f455e0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f45638[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f45660[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f45788[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:350:58[0m> [0;33mcol:30[0m[0;1;36m exceptions[0m [0;32m'void (iostate)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f456f8[0m <[0;33mcol:41[0m, [0;33mcol:49[0m> [0;33mcol:49[0m[0;1;36m __iostate[0m [0;32m'iostate':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f45838[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f45890[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f458b8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f45938[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:352:3[0m, [0;33mcol:42[0m> [0;33mcol:8[0m[0;1;36m __set_badbit_and_consider_rethrow[0m [0;32m'void ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f45a00[0m <[0;33mline:353:3[0m, [0;33mcol:43[0m> [0;33mcol:8[0m[0;1;36m __set_failbit_and_consider_rethrow[0m [0;32m'void ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f45b88[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:360:3[0m> [0;33mline:355:30[0m[0;1;36m __setstate_nothrow[0m [0;32m'void (iostate)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f45af8[0m <[0;33mcol:49[0m, [0;33mcol:57[0m> [0;33mcol:57[0m used[0;1;36m __state[0m [0;32m'iostate':'unsigned int'[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe075f47c88[0m <[0;33mcol:66[0m, [0;33mline:360:3[0m>
[0;34m| | `-[0m[0;1;35mIfStmt[0m[0;33m 0x7fe075f47c58[0m <[0;33mline:356:5[0m, [0;33mline:359:41[0m> has_else
[0;34m| |   |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f47978[0m <[0;33mline:356:9[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m <[0;31mPointerToBoolean[0m>
[0;34m| |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f47960[0m <[0;33mcol:9[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   |   `-[0m[0;1;35mMemberExpr[0m[0;33m 0x7fe075f47930[0m <[0;33mcol:9[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m ->__rdbuf_[0;33m 0x7fe075f46ff8[0m
[0;34m| |   |     `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x7fe075f47920[0m <[0;33mcol:9[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |   |-[0m[0;1;35mCompoundAssignOperator[0m[0;33m 0x7fe075f47a50[0m <[0;33mline:357:7[0m, [0;33mcol:21[0m> [0;32m'iostate':'unsigned int'[0m[0;36m lvalue[0m[0;36m[0m '|=' ComputeLHSTy=[0;32m'iostate':'unsigned int'[0m ComputeResultTy=[0;32m'iostate':'unsigned int'[0m
[0;34m| |   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x7fe075f479e8[0m <[0;33mcol:7[0m> [0;32m'iostate':'unsigned int'[0m[0;36m lvalue[0m[0;36m[0m ->__rdstate_[0;33m 0x7fe075f46f30[0m
[0;34m| |   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x7fe075f479d8[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f47a38[0m <[0;33mcol:21[0m> [0;32m'iostate':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f47a18[0m <[0;33mcol:21[0m> [0;32m'iostate':'unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x7fe075f45af8[0m[0;1;36m '__state'[0m [0;32m'iostate':'unsigned int'[0m
[0;34m| |   `-[0m[0;1;35mCompoundAssignOperator[0m[0;33m 0x7fe075f47c28[0m <[0;33mline:359:7[0m, [0;33mcol:41[0m> [0;32m'iostate':'unsigned int'[0m[0;36m lvalue[0m[0;36m[0m '|=' ComputeLHSTy=[0;32m'iostate':'unsigned int'[0m ComputeResultTy=[0;32m'iostate':'unsigned int'[0m
[0;34m| |     |-[0m[0;1;35mMemberExpr[0m[0;33m 0x7fe075f47ad8[0m <[0;33mcol:7[0m> [0;32m'iostate':'unsigned int'[0m[0;36m lvalue[0m[0;36m[0m ->__rdstate_[0;33m 0x7fe075f46f30[0m
[0;34m| |     | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x7fe075f47ac8[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |     `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x7fe075f47c08[0m <[0;33mcol:21[0m, [0;33mcol:41[0m> [0;32m'iostate':'unsigned int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m| |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f47ba8[0m <[0;33mcol:21[0m> [0;32m'iostate':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f47b08[0m <[0;33mcol:21[0m> [0;32m'iostate':'unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x7fe075f45af8[0m[0;1;36m '__state'[0m [0;32m'iostate':'unsigned int'[0m
[0;34m| |       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f47bf0[0m <[0;33mcol:31[0m, [0;33mcol:41[0m> [0;32m'iostate':'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f47bc0[0m <[0;33mcol:31[0m, [0;33mcol:41[0m> [0;32m'const iostate':'const unsigned int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe075f40e20[0m[0;1;36m 'badbit'[0m [0;32m'const iostate':'const unsigned int'[0m non_odr_use_constant
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f45c38[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f45c90[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f45cb8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe075f45d08[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:362:1[0m, [0;33mcol:10[0m> [0;33mcol:1[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe075f45d90[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:364:3[0m> [0;33mline:363:25[0m[0;1;36m ios_base[0m [0;32m'void ()'[0m implicit-inline
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe075f47ca0[0m <[0;33mcol:36[0m, [0;33mline:364:3[0m>
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f45e40[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f45e98[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f45ec0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f45fc0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:366:3[0m, [0;33mcol:23[0m> [0;33mcol:8[0m referenced[0;1;36m init[0m [0;32m'void (void *)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f45f30[0m <[0;33mcol:13[0m, [0;33mcol:19[0m> [0;33mcol:19[0m[0;1;36m __sb[0m [0;32m'void *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f46100[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:367:64[0m> [0;33mcol:31[0m[0;1;36m rdbuf[0m [0;32m'void *() const'[0m implicit-inline
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe075f47d18[0m <[0;33mcol:45[0m, [0;33mcol:64[0m>
[0;34m| | `-[0m[0;1;35mReturnStmt[0m[0;33m 0x7fe075f47d08[0m <[0;33mcol:47[0m, [0;33mcol:54[0m>
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f47cf0[0m <[0;33mcol:54[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x7fe075f47cc0[0m <[0;33mcol:54[0m> [0;32m'void *const'[0m[0;36m lvalue[0m[0;36m[0m ->__rdbuf_[0;33m 0x7fe075f46ff8[0m
[0;34m| |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x7fe075f47cb0[0m <[0;33mcol:54[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f461a8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f46200[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f46228[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f46360[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:372:3[0m> [0;33mline:369:30[0m[0;1;36m rdbuf[0m [0;32m'void (void *)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f462d0[0m <[0;33mcol:36[0m, [0;33mcol:42[0m> [0;33mcol:42[0m used[0;1;36m __sb[0m [0;32m'void *'[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe075f48028[0m <[0;33mcol:48[0m, [0;33mline:372:3[0m>
[0;34m| | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x7fe075f47df0[0m <[0;33mline:370:5[0m, [0;33mcol:16[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m| | | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x7fe075f47d88[0m <[0;33mcol:5[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m ->__rdbuf_[0;33m 0x7fe075f46ff8[0m
[0;34m| | | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x7fe075f47d78[0m <[0;33mcol:5[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f47dd8[0m <[0;33mcol:16[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f47db8[0m <[0;33mcol:16[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x7fe075f462d0[0m[0;1;36m '__sb'[0m [0;32m'void *'[0m
[0;34m| | `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x7fe075f47e98[0m <[0;33mline:371:5[0m, [0;33mcol:11[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m
[0;34m| |   |-[0m[0;1;35mMemberExpr[0m[0;33m 0x7fe075f47e68[0m <[0;33mcol:5[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->clear[0;33m 0x7fe075f44a88[0m
[0;34m| |   | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x7fe075f47e58[0m <[0;33mcol:5[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |   `-[0m[0;1;35mCXXDefaultArgExpr[0m[0;33m 0x7fe075f47ec0[0m <[0;33m<invalid sloc>[0m> [0;32m'iostate':'unsigned int'[0m[0;36m[0m[0;36m[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f46410[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f46468[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f46490[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f465e8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:374:3[0m, [0;33mcol:30[0m> [0;33mcol:8[0m referenced[0;1;36m __call_callbacks[0m [0;32m'void (event)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f464f8[0m <[0;33mcol:25[0m> [0;33mcol:30[0m [0;32m'event':'std::ios_base::event'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f46740[0m <[0;33mline:375:3[0m, [0;33mcol:31[0m> [0;33mcol:8[0m referenced[0;1;36m copyfmt[0m [0;32m'void (const ios_base &)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f466b0[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;33mcol:31[0m [0;32m'const ios_base &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f468f8[0m <[0;33mline:376:3[0m, [0;33mcol:22[0m> [0;33mcol:8[0m referenced[0;1;36m move[0m [0;32m'void (ios_base &)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f46808[0m <[0;33mcol:13[0m, [0;33mcol:21[0m> [0;33mcol:22[0m [0;32m'ios_base &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f46ac0[0m <[0;33mline:377:3[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:628:23[0m> [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:377:8[0m referenced[0;1;36m swap[0m [0;32m'void (ios_base &) noexcept'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f469c0[0m <[0;33mcol:13[0m, [0;33mcol:21[0m> [0;33mcol:22[0m [0;32m'ios_base &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f46c58[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:379:71[0m> [0;33mcol:30[0m referenced[0;1;36m set_rdbuf[0m [0;32m'void (void *)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f46bc8[0m <[0;33mcol:40[0m, [0;33mcol:46[0m> [0;33mcol:46[0m used[0;1;36m __sb[0m [0;32m'void *'[0m
[0;34m| |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x7fe075f48128[0m <[0;33mcol:52[0m, [0;33mcol:71[0m>
[0;34m| | `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x7fe075f48108[0m <[0;33mcol:54[0m, [0;33mcol:65[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m| |   |-[0m[0;1;35mMemberExpr[0m[0;33m 0x7fe075f480a0[0m <[0;33mcol:54[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m ->__rdbuf_[0;33m 0x7fe075f46ff8[0m
[0;34m| |   | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x7fe075f48090[0m <[0;33mcol:54[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f480f0[0m <[0;33mcol:65[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f480d0[0m <[0;33mcol:65[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x7fe075f46bc8[0m[0;1;36m '__sb'[0m [0;32m'void *'[0m
[0;34m| |-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f46d08[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Hidden
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f46d60[0m <[0;33mline:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f46d88[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe075f46dd8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:381:1[0m, [0;33mcol:8[0m> [0;33mcol:1[0m private
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f46e10[0m <[0;33mline:383:3[0m, [0;33mcol:12[0m> [0;33mcol:12[0m referenced[0;1;36m __fmtflags_[0m [0;32m'fmtflags':'unsigned int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f46e70[0m <[0;33mline:384:3[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m __precision_[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f46ed0[0m <[0;33mline:385:3[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m __width_[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f46f30[0m <[0;33mline:386:3[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced[0;1;36m __rdstate_[0m [0;32m'iostate':'unsigned int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f46f90[0m <[0;33mline:387:3[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced[0;1;36m __exceptions_[0m [0;32m'iostate':'unsigned int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f46ff8[0m <[0;33mline:388:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m referenced[0;1;36m __rdbuf_[0m [0;32m'void *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47060[0m <[0;33mline:389:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m[0;1;36m __loc_[0m [0;32m'void *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47128[0m <[0;33mline:390:3[0m, [0;33mcol:19[0m> [0;33mcol:19[0m[0;1;36m __fn_[0m [0;32m'event_callback *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47190[0m <[0;33mline:391:3[0m, [0;33mcol:8[0m> [0;33mcol:8[0m[0;1;36m __index_[0m [0;32m'int *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47250[0m <[0;33mline:392:3[0m, [0;33mcol:10[0m> [0;33mcol:10[0m[0;1;36m __event_size_[0m [0;32m'size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47310[0m <[0;33mline:393:3[0m, [0;33mcol:10[0m> [0;33mcol:10[0m[0;1;36m __event_cap_[0m [0;32m'size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x7fe075f47430[0m <[0;33mline:397:3[0m, [0;33mcol:22[0m> [0;33mcol:22[0m[0;1;36m __xindex_[0m [0;32m'atomic<int>':'std::atomic<int>'[0m static
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f474b0[0m <[0;33mline:401:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m[0;1;36m __iarray_[0m [0;32m'long *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47570[0m <[0;33mline:402:3[0m, [0;33mcol:10[0m> [0;33mcol:10[0m[0;1;36m __iarray_size_[0m [0;32m'size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47630[0m <[0;33mline:403:3[0m, [0;33mcol:10[0m> [0;33mcol:10[0m[0;1;36m __iarray_cap_[0m [0;32m'size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47698[0m <[0;33mline:404:3[0m, [0;33mcol:10[0m> [0;33mcol:10[0m[0;1;36m __parray_[0m [0;32m'void **'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47760[0m <[0;33mline:405:3[0m, [0;33mcol:10[0m> [0;33mcol:10[0m[0;1;36m __parray_size_[0m [0;32m'size_t':'unsigned long'[0m
[0;34m`-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f47820[0m <[0;33mline:406:3[0m, [0;33mcol:10[0m> [0;33mcol:10[0m[0;1;36m __parray_cap_[0m [0;32m'size_t':'unsigned long'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::ios_base" = type { ptr, i32, i64, i64, i32, i32, ptr, ptr, ptr, ptr, i64, i64, ptr, i64, i64, ptr, i64, i64 }
  NonVirtualBaseLLVMType:%"class.std::__1::ios_base" = type { ptr, i32, i64, i64, i32, i32, ptr, ptr, ptr, ptr, i64, i64, ptr, i64, i64, ptr, i64, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x7fe073035ed0[0m parent 0x7fe073035918 <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:698:1[0m, [0;33mcol:70[0m> [0;33mcol:56[0m class[0;1;36m basic_ios[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor has_mutable_fields can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0mpublic [0;32m'ios_base':'std::ios_base'[0m
[0;34m|-[0mTemplateArgument type [0;32m'char'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe0730228b0[0m [0;32m'char'[0m
[0;34m|-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mRecordType[0m[0;33m 0x7fe07302ae80[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe070e0bf90[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe075f602e0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:54[0m, [0;33mcol:72[0m> Default
[0;34m|-[0m[0;1;34mPreferredNameAttr[0m[0;33m 0x7fe075f60348[0m <[0;33mline:1538:54[0m, [0;33mcol:74[0m> ios
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe075f60410[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:520:1[0m, [0;33mcol:28[0m> [0;33mcol:28[0m implicit class[0;1;36m basic_ios[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe075f604a0[0m <[0;33mline:521:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f60508[0m <[0;33mline:523:3[0m, [0;33mcol:18[0m> [0;33mcol:18[0m referenced[0;1;36m char_type[0m [0;32m'char':'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x7fe075f604d0[0m [0;32m'char'[0m sugar class depth 0 index 0[0;1;36m _CharT[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe073035ed0[0m[0;1;36m 'basic_ios'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe0730228b0[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f60598[0m <[0;33mline:524:3[0m, [0;33mcol:19[0m> [0;33mcol:19[0m referenced[0;1;36m traits_type[0m [0;32m'std::char_traits<char>':'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x7fe075f60560[0m [0;32m'std::char_traits<char>'[0m sugar class depth 0 index 1[0;1;36m _Traits[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe073035ed0[0m[0;1;36m 'basic_ios'[0m
[0;34m|   `-[0m[0;32mRecordType[0m[0;33m 0x7fe07302ae80[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe070e0bf90[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f606a0[0m <[0;33mline:526:3[0m, [0;33mcol:42[0m> [0;33mcol:42[0m referenced[0;1;36m int_type[0m [0;32m'typename traits_type::int_type':'int'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe075f60650[0m [0;32m'typename traits_type::int_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x7fe070e12b30[0m [0;32m'std::char_traits<char>::int_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypeAlias[0m[0;33m 0x7fe070e0c290[0m[0;1;36m 'int_type'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe073022910[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f607a0[0m <[0;33mline:527:3[0m, [0;33mcol:42[0m> [0;33mcol:42[0m[0;1;36m pos_type[0m [0;32m'typename traits_type::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe075f60750[0m [0;32m'typename traits_type::pos_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x7fe075f60720[0m [0;32m'std::char_traits<char>::pos_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypeAlias[0m[0;33m 0x7fe070e0c370[0m[0;1;36m 'pos_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe070e06720[0m [0;32m'streampos'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x7fe070e066f0[0m [0;32m'std::streampos'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x7fe070d88250[0m[0;1;36m 'streampos'[0m
[0;34m|         `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe070d881e0[0m [0;32m'fpos<mbstate_t>'[0m sugar
[0;34m|           `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x7fe070d881a0[0m [0;32m'fpos<mbstate_t>'[0m sugar fpos
[0;34m|             |-[0mTemplateArgument type [0;32m'mbstate_t':'__mbstate_t'[0m
[0;34m|             | `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe070d88060[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |   `-[0m[0;32mUsingType[0m[0;33m 0x7fe070d88030[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |     |-[0m[0;1;32mUsingShadow[0m[0;33m 0x7fe070d87268[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |     `-[0m[0;32mTypedefType[0m[0;33m 0x7fe070d88000[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |       |-[0m[0;1;32mTypedef[0m[0;33m 0x7fe070d87000[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |       `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe070d86fc0[0m [0;32m'__darwin_mbstate_t'[0m sugar
[0;34m|             |         `-[0m[0;32mTypedefType[0m[0;33m 0x7fe070d86f90[0m [0;32m'__darwin_mbstate_t'[0m sugar
[0;34m|             |           |-[0m[0;1;32mTypedef[0m[0;33m 0x7fe07306c740[0m[0;1;36m '__darwin_mbstate_t'[0m
[0;34m|             |           `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe07306c700[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |             `-[0m[0;32mTypedefType[0m[0;33m 0x7fe07306c6d0[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |               |-[0m[0;1;32mTypedef[0m[0;33m 0x7fe07306c658[0m[0;1;36m '__mbstate_t'[0m
[0;34m|             |               `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe07306c600[0m [0;32m'union __mbstate_t'[0m sugar
[0;34m|             |                 `-[0m[0;32mRecordType[0m[0;33m 0x7fe07306c400[0m [0;32m'__mbstate_t'[0m
[0;34m|             |                   `-[0m[0;1;32mCXXRecord[0m[0;33m 0x7fe07306c368[0m[0;1;36m ''[0m
[0;34m|             `-[0m[0;32mRecordType[0m[0;33m 0x7fe070d88180[0m [0;32m'std::fpos<__mbstate_t>'[0m
[0;34m|               `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe070d880a0[0m[0;1;36m 'fpos'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe075f608a0[0m <[0;33mline:528:3[0m, [0;33mcol:42[0m> [0;33mcol:42[0m[0;1;36m off_type[0m [0;32m'typename traits_type::off_type':'long long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe075f60850[0m [0;32m'typename traits_type::off_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x7fe075f60820[0m [0;32m'std::char_traits<char>::off_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypeAlias[0m[0;33m 0x7fe070e0c300[0m[0;1;36m 'off_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe07400dc00[0m [0;32m'streamoff'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x7fe07400dbd0[0m [0;32m'std::streamoff'[0m sugar
[0;34m|         |-[0m[0;1;32mTypeAlias[0m[0;33m 0x7fe073036770[0m[0;1;36m 'streamoff'[0m
[0;34m|         `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe073022950[0m [0;32m'long long'[0m
[0;34m|-[0m[0;1;32mStaticAssertDecl[0m[0;33m 0x7fe075f60b00[0m <[0;33mline:530:3[0m, [0;33mline:531:72[0m> [0;33mline:530:3[0m
[0;34m| |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x7fe075f60ac8[0m <[0;33mcol:17[0m, [0;33mcol:73[0m> [0;32m'bool':'bool'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | `-[0m[0;1;35mParenExpr[0m[0;33m 0x7fe075f60aa8[0m <[0;33mcol:17[0m, [0;33mcol:73[0m> [0;32m'const bool':'const bool'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m| |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x7fe075f60a78[0m <[0;33mcol:18[0m, [0;33mcol:68[0m> [0;32m'const bool':'const bool'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x7fe07280c208[0m[0;1;36m 'value'[0m [0;32m'const bool':'const bool'[0m non_odr_use_constant
[0;34m| `-[0m[0;1;35mStringLiteral[0m[0;33m 0x7fe075f508a0[0m <[0;33mline:531:17[0m> [0;32m'NULL TYPE'[0m[0;36m lvalue[0m[0;36m[0m[0;1;36m "traits_type::char_type must be the same type as CharT"[0m
[0;34m|-[0m[0;1;32mCXXConversionDecl[0m[0;33m 0x7fe075f60b40[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:538:74[0m> [0;33mcol:34[0m[0;1;36m operator bool[0m [0;32m'bool () const'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f60c30[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f60c88[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f60ce0[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:541:65[0m> [0;33mcol:30[0m[0;1;36m operator![0m [0;32m'bool () const'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f60d98[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f60df0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f60e38[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:542:79[0m> [0;33mcol:33[0m[0;1;36m rdstate[0m [0;32m'iostate () const'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f60ef0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f60f48[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f61028[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:543:91[0m> [0;33mcol:30[0m[0;1;36m clear[0m [0;32m'void (iostate)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f60f98[0m <[0;33mcol:36[0m, [0;33mcol:54[0m> [0;33mcol:44[0m[0;1;36m __state[0m [0;32m'iostate':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f610e8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f61140[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f61218[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:544:87[0m> [0;33mcol:30[0m[0;1;36m setstate[0m [0;32m'void (iostate)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f61188[0m <[0;33mcol:39[0m, [0;33mcol:47[0m> [0;33mcol:47[0m[0;1;36m __state[0m [0;32m'iostate':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f612d8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f61330[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f61378[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:545:70[0m> [0;33mcol:30[0m[0;1;36m good[0m [0;32m'bool () const'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f61430[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f61488[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f614d8[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:546:68[0m> [0;33mcol:30[0m[0;1;36m eof[0m [0;32m'bool () const'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f61590[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f615e8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f61638[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:547:70[0m> [0;33mcol:30[0m[0;1;36m fail[0m [0;32m'bool () const'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f616f0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f61748[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f61798[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:548:68[0m> [0;33mcol:30[0m[0;1;36m bad[0m [0;32m'bool () const'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f61850[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f618a8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f618f8[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:550:85[0m> [0;33mcol:33[0m[0;1;36m exceptions[0m [0;32m'iostate () const'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f619b0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f61a08[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f61ae8[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:551:95[0m> [0;33mcol:30[0m[0;1;36m exceptions[0m [0;32m'void (iostate)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f61a58[0m <[0;33mcol:41[0m, [0;33mcol:49[0m> [0;33mcol:49[0m[0;1;36m __iostate[0m [0;32m'iostate':'unsigned int'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f61ba8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f61c00[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe075f61fc0[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:554:89[0m> [0;33mcol:34[0m[0;1;36m basic_ios[0m [0;32m'void (basic_streambuf<char_type, traits_type> *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f61e90[0m <[0;33mcol:44[0m, [0;33mcol:85[0m> [0;33mcol:85[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char_type, traits_type> *'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f62088[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f620e0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x7fe075f62150[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:555:3[0m, [0;33mcol:16[0m> [0;33mcol:3[0m[0;1;36m ~basic_ios[0m [0;32m'void () noexcept'[0m
[0;34m| |-[0mOverrides: [ 0x7fe075f43988 ios_base::~ios_base 'void () noexcept' ]
[0;34m| `-[0m[0;1;34mOverrideAttr[0m[0;33m 0x7fe075f62218[0m <[0;33mcol:16[0m> Inherited
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f624a8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:558:70[0m> [0;33mcol:64[0m[0;1;36m tie[0m [0;32m'basic_ostream<char_type, traits_type> *() const'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f62560[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f625b8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f62918[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:559:115[0m> [0;33mcol:64[0m[0;1;36m tie[0m [0;32m'basic_ostream<char_type, traits_type> *(basic_ostream<char_type, traits_type> *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f62800[0m <[0;33mcol:68[0m, [0;33mcol:107[0m> [0;33mcol:107[0m[0;1;36m __tiestr[0m [0;32m'basic_ostream<char_type, traits_type> *'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f629d8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f62a30[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f62c08[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:561:74[0m> [0;33mcol:66[0m[0;1;36m rdbuf[0m [0;32m'basic_streambuf<char_type, traits_type> *() const'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f62cc0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f62d18[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f63078[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:562:117[0m> [0;33mcol:66[0m[0;1;36m rdbuf[0m [0;32m'basic_streambuf<char_type, traits_type> *(basic_streambuf<char_type, traits_type> *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f62f60[0m <[0;33mcol:72[0m, [0;33mcol:113[0m> [0;33mcol:113[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char_type, traits_type> *'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f63138[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f63190[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f633f0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:564:3[0m, [0;33mcol:44[0m> [0;33mcol:14[0m[0;1;36m copyfmt[0m [0;32m'ios &(const ios &)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f632f0[0m <[0;33mcol:22[0m, [0;33mcol:39[0m> [0;33mcol:39[0m[0;1;36m __rhs[0m [0;32m'const ios &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f634f8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:566:42[0m> [0;33mcol:35[0m[0;1;36m fill[0m [0;32m'char_type () const'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f635b0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f63608[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f63758[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:567:54[0m> [0;33mcol:35[0m[0;1;36m fill[0m [0;32m'char_type (char_type)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f63668[0m <[0;33mcol:40[0m, [0;33mcol:50[0m> [0;33mcol:50[0m[0;1;36m __ch[0m [0;32m'char_type':'char'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f63818[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f63870[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f63958[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:569:57[0m> [0;33mcol:32[0m[0;1;36m imbue[0m [0;32m'locale (const locale &)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f638c8[0m <[0;33mcol:38[0m, [0;33mcol:52[0m> [0;33mcol:52[0m[0;1;36m __loc[0m [0;32m'const locale &'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f63a18[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f63a70[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f63c08[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:571:67[0m> [0;33mcol:30[0m[0;1;36m narrow[0m [0;32m'char (char_type, char) const'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f63ac8[0m <[0;33mcol:37[0m, [0;33mcol:47[0m> [0;33mcol:47[0m[0;1;36m __c[0m [0;32m'char_type':'char'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f63b30[0m <[0;33mcol:52[0m, [0;33mcol:57[0m> [0;33mcol:57[0m[0;1;36m __dfault[0m [0;32m'char'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f63cd0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f63d28[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f63e38[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:572:51[0m> [0;33mcol:35[0m[0;1;36m widen[0m [0;32m'char_type (char) const'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f63d78[0m <[0;33mcol:41[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __c[0m [0;32m'char'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f63ef8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f63f50[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe075f63f98[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:574:1[0m, [0;33mcol:10[0m> [0;33mcol:1[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe075f63fe0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:576:3[0m> [0;33mline:575:25[0m[0;1;36m basic_ios[0m [0;32m'void ()'[0m implicit-inline
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f640a0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f640f8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f64338[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:577:80[0m> [0;33mcol:30[0m[0;1;36m init[0m [0;32m'void (basic_streambuf<char_type, traits_type> *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f64270[0m <[0;33mcol:35[0m, [0;33mcol:76[0m> [0;33mcol:76[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char_type, traits_type> *'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f643f8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f64450[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f645a8[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:579:51[0m> [0;33mcol:30[0m[0;1;36m move[0m [0;32m'void (ios &)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f644b0[0m <[0;33mcol:35[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __rhs[0m [0;32m'ios &'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f64668[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f646c0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f64878[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:580:69[0m> [0;33mcol:30[0m[0;1;36m move[0m [0;32m'void (ios &&)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f64780[0m <[0;33mcol:35[0m, [0;33mcol:47[0m> [0;33mcol:47[0m[0;1;36m __rhs[0m [0;32m'ios &&'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f64938[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f64990[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f64b00[0m <[0;33mline:760:39[0m, [0;33mline:628:23[0m> [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:581:30[0m[0;1;36m swap[0m [0;32m'void (ios &) noexcept'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f64a00[0m <[0;33mcol:35[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __rhs[0m [0;32m'ios &'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f64bc0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f64c18[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f64e48[0m <[0;33mline:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:582:85[0m> [0;33mcol:30[0m[0;1;36m set_rdbuf[0m [0;32m'void (basic_streambuf<char_type, traits_type> *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f64d80[0m <[0;33mcol:40[0m, [0;33mcol:81[0m> [0;33mcol:81[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char_type, traits_type> *'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe075f64f08[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe075f64f60[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe075f64fa8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:584:1[0m, [0;33mcol:8[0m> [0;33mcol:1[0m private
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f650e0[0m <[0;33mline:585:3[0m, [0;33mcol:42[0m> [0;33mcol:42[0m[0;1;36m __tie_[0m [0;32m'basic_ostream<char_type, traits_type> *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe075f651a0[0m <[0;33mline:586:3[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m __fill_[0m [0;32m'int_type':'int'[0m mutable
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe075f651f0[0m <[0;33mline:698:56[0m> [0;33mcol:56[0m implicit[0;1;36m basic_ios[0m [0;32m'void (const ios &)'[0m inline default_delete noexcept-unevaluated 0x7fe075f651f0
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f65308[0m <[0;33mcol:56[0m> [0;33mcol:56[0m [0;32m'const ios &'[0m
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe075f65388[0m <[0;33mcol:56[0m> [0;33mcol:56[0m implicit[0;1;36m operator=[0m [0;32m'ios &(const ios &)'[0m inline default_delete noexcept-unevaluated 0x7fe075f65388
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe075f65468[0m <[0;33mcol:56[0m> [0;33mcol:56[0m [0;32m'const ios &'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ios" = type <{ %"class.std::__1::ios_base", ptr, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", ptr, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x7fe0718285b0[0m parent 0x7fe071828000 <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:1019:1[0m, [0;33mcol:74[0m> [0;33mcol:56[0m class[0;1;36m basic_ostream[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor has_mutable_fields can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists non_trivial user_declared needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists non_trivial user_declared needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0mvirtual public [0;32m'basic_ios<char, char_traits<char>>':'std::ios'[0m
[0;34m|-[0mTemplateArgument type [0;32m'char'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe0730228b0[0m [0;32m'char'[0m
[0;34m|-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mRecordType[0m[0;33m 0x7fe07302ae80[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe070e0bf90[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;34mPreferredNameAttr[0m[0;33m 0x7fe075f622c0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:1538:54[0m, [0;33mcol:74[0m> ostream
[0;34m|-[0m[0;1;34mVisibilityAttr[0m[0;33m 0x7fe0777875e0[0m <[0;33mline:760:54[0m, [0;33mcol:72[0m> Default
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe077787800[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:208:1[0m, [0;33mcol:28[0m> [0;33mcol:28[0m implicit class[0;1;36m basic_ostream[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe077787890[0m <[0;33mline:209:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe0777878c8[0m <[0;33mline:211:3[0m, [0;33mcol:18[0m> [0;33mcol:18[0m referenced[0;1;36m char_type[0m [0;32m'char':'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x7fe077787680[0m [0;32m'char'[0m sugar class depth 0 index 0[0;1;36m _CharT[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe0718285b0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe0730228b0[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe077787930[0m <[0;33mline:212:3[0m, [0;33mcol:19[0m> [0;33mcol:19[0m referenced[0;1;36m traits_type[0m [0;32m'std::char_traits<char>':'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x7fe0777876c0[0m [0;32m'std::char_traits<char>'[0m sugar class depth 0 index 1[0;1;36m _Traits[0m
[0;34m|   |-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe0718285b0[0m[0;1;36m 'basic_ostream'[0m
[0;34m|   `-[0m[0;32mRecordType[0m[0;33m 0x7fe07302ae80[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe070e0bf90[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe077787a40[0m <[0;33mline:213:3[0m, [0;33mcol:42[0m> [0;33mcol:42[0m[0;1;36m int_type[0m [0;32m'typename traits_type::int_type':'int'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe0777879f0[0m [0;32m'typename traits_type::int_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x7fe070e12b30[0m [0;32m'std::char_traits<char>::int_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypeAlias[0m[0;33m 0x7fe070e0c290[0m[0;1;36m 'int_type'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe073022910[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe077787b10[0m <[0;33mline:214:3[0m, [0;33mcol:42[0m> [0;33mcol:42[0m referenced[0;1;36m pos_type[0m [0;32m'typename traits_type::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe077787ac0[0m [0;32m'typename traits_type::pos_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x7fe075f60720[0m [0;32m'std::char_traits<char>::pos_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypeAlias[0m[0;33m 0x7fe070e0c370[0m[0;1;36m 'pos_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe070e06720[0m [0;32m'streampos'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x7fe070e066f0[0m [0;32m'std::streampos'[0m sugar
[0;34m|         |-[0m[0;1;32mTypedef[0m[0;33m 0x7fe070d88250[0m[0;1;36m 'streampos'[0m
[0;34m|         `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe070d881e0[0m [0;32m'fpos<mbstate_t>'[0m sugar
[0;34m|           `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x7fe070d881a0[0m [0;32m'fpos<mbstate_t>'[0m sugar fpos
[0;34m|             |-[0mTemplateArgument type [0;32m'mbstate_t':'__mbstate_t'[0m
[0;34m|             | `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe070d88060[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |   `-[0m[0;32mUsingType[0m[0;33m 0x7fe070d88030[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |     |-[0m[0;1;32mUsingShadow[0m[0;33m 0x7fe070d87268[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |     `-[0m[0;32mTypedefType[0m[0;33m 0x7fe070d88000[0m [0;32m'mbstate_t'[0m sugar
[0;34m|             |       |-[0m[0;1;32mTypedef[0m[0;33m 0x7fe070d87000[0m[0;1;36m 'mbstate_t'[0m
[0;34m|             |       `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe070d86fc0[0m [0;32m'__darwin_mbstate_t'[0m sugar
[0;34m|             |         `-[0m[0;32mTypedefType[0m[0;33m 0x7fe070d86f90[0m [0;32m'__darwin_mbstate_t'[0m sugar
[0;34m|             |           |-[0m[0;1;32mTypedef[0m[0;33m 0x7fe07306c740[0m[0;1;36m '__darwin_mbstate_t'[0m
[0;34m|             |           `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe07306c700[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |             `-[0m[0;32mTypedefType[0m[0;33m 0x7fe07306c6d0[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|             |               |-[0m[0;1;32mTypedef[0m[0;33m 0x7fe07306c658[0m[0;1;36m '__mbstate_t'[0m
[0;34m|             |               `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe07306c600[0m [0;32m'union __mbstate_t'[0m sugar
[0;34m|             |                 `-[0m[0;32mRecordType[0m[0;33m 0x7fe07306c400[0m [0;32m'__mbstate_t'[0m
[0;34m|             |                   `-[0m[0;1;32mCXXRecord[0m[0;33m 0x7fe07306c368[0m[0;1;36m ''[0m
[0;34m|             `-[0m[0;32mRecordType[0m[0;33m 0x7fe070d88180[0m [0;32m'std::fpos<__mbstate_t>'[0m
[0;34m|               `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x7fe070d880a0[0m[0;1;36m 'fpos'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x7fe077787be0[0m <[0;33mline:215:3[0m, [0;33mcol:42[0m> [0;33mcol:42[0m referenced[0;1;36m off_type[0m [0;32m'typename traits_type::off_type':'long long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe077787b90[0m [0;32m'typename traits_type::off_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x7fe075f60820[0m [0;32m'std::char_traits<char>::off_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypeAlias[0m[0;33m 0x7fe070e0c300[0m[0;1;36m 'off_type'[0m
[0;34m|     `-[0m[0;32mElaboratedType[0m[0;33m 0x7fe07400dc00[0m [0;32m'streamoff'[0m sugar
[0;34m|       `-[0m[0;32mTypedefType[0m[0;33m 0x7fe07400dbd0[0m [0;32m'std::streamoff'[0m sugar
[0;34m|         |-[0m[0;1;32mTypeAlias[0m[0;33m 0x7fe073036770[0m[0;1;36m 'streamoff'[0m
[0;34m|         `-[0m[0;32mBuiltinType[0m[0;33m 0x7fe073022950[0m [0;32m'long long'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe077787ee0[0m <[0;33mline:218:3[0m, [0;33mline:220:3[0m> [0;33mline:218:50[0m[0;1;36m basic_ostream[0m [0;32m'void (basic_streambuf<char_type, traits_type> *)'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077787de0[0m <[0;33mcol:64[0m, [0;33mcol:105[0m> [0;33mcol:105[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char_type, traits_type> *'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe077787fa8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe077788000[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x7fe077788070[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:221:3[0m, [0;33mcol:20[0m> [0;33mcol:3[0m[0;1;36m ~basic_ostream[0m [0;32m'void () noexcept'[0m
[0;34m| |-[0mOverrides: [ 0x7fe075f62150 basic_ios::~basic_ios 'void () noexcept' ]
[0;34m| `-[0m[0;1;34mOverrideAttr[0m[0;33m 0x7fe077788138[0m <[0;33mcol:20[0m> Inherited
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe0777881c0[0m <[0;33mline:223:1[0m, [0;33mcol:10[0m> [0;33mcol:1[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe0777883a8[0m <[0;33mline:224:3[0m, [0;33mcol:67[0m> [0;33mcol:32[0m[0;1;36m basic_ostream[0m [0;32m'void (ostream &&)'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077788290[0m <[0;33mcol:46[0m, [0;33mcol:62[0m> [0;33mcol:62[0m[0;1;36m __rhs[0m [0;32m'ostream &&'[0m
[0;34m| `-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe077788470[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m> Inherited
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe077788650[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:227:3[0m, [0;33mcol:78[0m> [0;33mcol:47[0m[0;1;36m operator=[0m [0;32m'ostream &(ostream &&)'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077788550[0m <[0;33mcol:57[0m, [0;33mcol:73[0m> [0;33mcol:73[0m[0;1;36m __rhs[0m [0;32m'ostream &&'[0m
[0;34m| `-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe077788710[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m> Inherited
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe077788878[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:229:3[0m, [0;33mline:231:3[0m> [0;33mline:229:46[0m[0;1;36m swap[0m [0;32m'void (ostream &)'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077788780[0m <[0;33mcol:51[0m, [0;33mcol:66[0m> [0;33mcol:66[0m[0;1;36m __rhs[0m [0;32m'ostream &'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe077788938[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe077788990[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe077788b68[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:233:3[0m, [0;33mcol:63[0m> [0;33mcol:3[0m[0;1;36m basic_ostream[0m [0;32m'void (const ostream &)'[0m delete implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077788a50[0m <[0;33mcol:17[0m, [0;33mcol:38[0m> [0;33mcol:38[0m[0;1;36m __rhs[0m [0;32m'const ostream &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe077788d50[0m <[0;33mline:234:3[0m, [0;33mcol:63[0m> [0;33mcol:18[0m[0;1;36m operator=[0m [0;32m'ostream &(const ostream &)'[0m delete implicit-inline
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077788c58[0m <[0;33mcol:28[0m, [0;33mcol:49[0m> [0;33mcol:49[0m[0;1;36m __rhs[0m [0;32m'const ostream &'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe077788e20[0m <[0;33mline:236:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe077788e48[0m <[0;33mline:238:3[0m, [0;33mcol:30[0m> [0;33mcol:30[0m class[0;1;36m sentry[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x7fe07778c780[0m <[0;33mline:299:1[0m, [0;33mcol:60[0m> [0;33mcol:60[0m implicit class[0;1;36m sentry[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe07778c810[0m <[0;33mline:300:3[0m, [0;33mcol:8[0m> [0;33mcol:8[0m[0;1;36m __ok_[0m [0;32m'bool'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x7fe07778c968[0m <[0;33mline:301:3[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __os_[0m [0;32m'basic_ostream<char, char_traits<char>> &'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe07778c9b8[0m <[0;33mline:303:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe07778cbe0[0m <[0;33mline:304:3[0m, [0;33mcol:55[0m> [0;33mcol:12[0m[0;1;36m sentry[0m [0;32m'void (basic_ostream<char, char_traits<char>> &)'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778cae8[0m <[0;33mcol:19[0m, [0;33mcol:51[0m> [0;33mcol:51[0m[0;1;36m __os[0m [0;32m'basic_ostream<char, char_traits<char>> &'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x7fe07778ccd0[0m <[0;33mline:305:3[0m, [0;33mcol:11[0m> [0;33mcol:3[0m[0;1;36m ~sentry[0m [0;32m'void ()'[0m noexcept-unevaluated 0x7fe07778ccd0
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe07778cf88[0m <[0;33mline:306:3[0m, [0;33mcol:43[0m> [0;33mcol:3[0m[0;1;36m sentry[0m [0;32m'void (const sentry &)'[0m delete trivial implicit-inline
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778ce70[0m <[0;33mcol:10[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const sentry &'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778d1d0[0m <[0;33mline:307:3[0m, [0;33mcol:43[0m> [0;33mcol:11[0m[0;1;36m operator=[0m [0;32m'sentry &(const sentry &)'[0m delete trivial implicit-inline
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778d0d0[0m <[0;33mcol:21[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const sentry &'[0m
[0;34m| `-[0m[0;1;32mCXXConversionDecl[0m[0;33m 0x7fe07778d290[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:309:72[0m> [0;33mcol:34[0m[0;1;36m operator bool[0m [0;32m'bool () const'[0m implicit-inline
[0;34m|   |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe07778d380[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m|   `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe07778d3d8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777891c0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:241:3[0m, [0;33mline:243:3[0m> [0;33mline:241:56[0m used[0;1;36m operator<<[0m [0;32m'ostream &(ostream &(*)(ostream &))'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777890c0[0m <[0;33mcol:67[0m, [0;33mcol:104[0m> [0;33mcol:84[0m[0;1;36m __pf[0m [0;32m'ostream &(*)(ostream &)'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe077789280[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe0777892d8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe0777897c0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:245:3[0m, [0;33mline:249:3[0m> [0;33mline:246:3[0m[0;1;36m operator<<[0m [0;32m'ostream &(basic_ios<char_type, traits_type> &(*)(basic_ios<char_type, traits_type> &))'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe0777896c8[0m <[0;33mcol:14[0m, [0;33mcol:91[0m> [0;33mcol:51[0m[0;1;36m __pf[0m [0;32m'basic_ios<char_type, traits_type> &(*)(basic_ios<char_type, traits_type> &)'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe077789880[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe0777898d8[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe077789a30[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:251:3[0m, [0;33mline:254:3[0m> [0;33mline:251:56[0m[0;1;36m operator<<[0m [0;32m'ostream &(ios_base &(*)(ios_base &))'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077789938[0m <[0;33mcol:67[0m, [0;33mcol:94[0m> [0;33mcol:79[0m[0;1;36m __pf[0m [0;32m'ios_base &(*)(ios_base &)'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe077789af0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe077789b48[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe077789ca0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:256:3[0m, [0;33mcol:37[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(bool)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077789ba8[0m <[0;33mcol:29[0m, [0;33mcol:34[0m> [0;33mcol:34[0m[0;1;36m __n[0m [0;32m'bool'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe077789e70[0m <[0;33mline:257:3[0m, [0;33mcol:38[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(short)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077789d70[0m <[0;33mcol:29[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __n[0m [0;32m'short'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778a040[0m <[0;33mline:258:3[0m, [0;33mcol:47[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(unsigned short)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe077789f40[0m <[0;33mcol:29[0m, [0;33mcol:44[0m> [0;33mcol:44[0m[0;1;36m __n[0m [0;32m'unsigned short'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778a210[0m <[0;33mline:259:3[0m, [0;33mcol:36[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778a110[0m <[0;33mcol:29[0m, [0;33mcol:33[0m> [0;33mcol:33[0m[0;1;36m __n[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778a3e0[0m <[0;33mline:260:3[0m, [0;33mcol:45[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(unsigned int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778a2e0[0m <[0;33mcol:29[0m, [0;33mcol:42[0m> [0;33mcol:42[0m[0;1;36m __n[0m [0;32m'unsigned int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778a5b0[0m <[0;33mline:261:3[0m, [0;33mcol:37[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(long)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778a4b0[0m <[0;33mcol:29[0m, [0;33mcol:34[0m> [0;33mcol:34[0m[0;1;36m __n[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778a780[0m <[0;33mline:262:3[0m, [0;33mcol:46[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(unsigned long)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778a680[0m <[0;33mcol:29[0m, [0;33mcol:43[0m> [0;33mcol:43[0m[0;1;36m __n[0m [0;32m'unsigned long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778a950[0m <[0;33mline:263:3[0m, [0;33mcol:42[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(long long)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778a850[0m <[0;33mcol:29[0m, [0;33mcol:39[0m> [0;33mcol:39[0m[0;1;36m __n[0m [0;32m'long long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778ab20[0m <[0;33mline:264:3[0m, [0;33mcol:51[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(unsigned long long)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778aa20[0m <[0;33mcol:29[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __n[0m [0;32m'unsigned long long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778acf0[0m <[0;33mline:265:3[0m, [0;33mcol:38[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(float)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778abf0[0m <[0;33mcol:29[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __f[0m [0;32m'float'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778aec0[0m <[0;33mline:266:3[0m, [0;33mcol:39[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(double)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778adc0[0m <[0;33mcol:29[0m, [0;33mcol:36[0m> [0;33mcol:36[0m[0;1;36m __f[0m [0;32m'double'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778b090[0m <[0;33mline:267:3[0m, [0;33mcol:44[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(long double)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778af90[0m <[0;33mcol:29[0m, [0;33mcol:41[0m> [0;33mcol:41[0m[0;1;36m __f[0m [0;32m'long double'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778b260[0m <[0;33mline:268:3[0m, [0;33mcol:44[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(const void *)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778b160[0m <[0;33mcol:29[0m, [0;33mcol:41[0m> [0;33mcol:41[0m[0;1;36m __p[0m [0;32m'const void *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778b540[0m <[0;33mline:276:3[0m, [0;33mcol:74[0m> [0;33mcol:18[0m[0;1;36m operator<<[0m [0;32m'ostream &(basic_streambuf<char_type, traits_type> *)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778b440[0m <[0;33mcol:29[0m, [0;33mcol:70[0m> [0;33mcol:70[0m[0;1;36m __sb[0m [0;32m'basic_streambuf<char_type, traits_type> *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778b710[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:281:91[0m> [0;33mcol:40[0m[0;1;36m operator<<[0m [0;32m'ostream &(nullptr_t)'[0m implicit-inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778b610[0m <[0;33mcol:51[0m> [0;33mcol:60[0m [0;32m'nullptr_t':'std::nullptr_t'[0m
[0;34m| |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe07778b7d0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe07778b828[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778b990[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:285:3[0m, [0;33mcol:35[0m> [0;33mcol:18[0m[0;1;36m put[0m [0;32m'ostream &(char_type)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778b898[0m <[0;33mcol:22[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m __c[0m [0;32m'char_type':'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778bc20[0m <[0;33mline:286:3[0m, [0;33mcol:60[0m> [0;33mcol:18[0m[0;1;36m write[0m [0;32m'ostream &(const char_type *, streamsize)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778ba98[0m <[0;33mcol:24[0m, [0;33mcol:41[0m> [0;33mcol:41[0m[0;1;36m __s[0m [0;32m'const char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778bb00[0m <[0;33mcol:46[0m, [0;33mcol:57[0m> [0;33mcol:57[0m[0;1;36m __n[0m [0;32m'streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778bd70[0m <[0;33mline:287:3[0m, [0;33mcol:24[0m> [0;33mcol:18[0m[0;1;36m flush[0m [0;32m'ostream &()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778bf08[0m <[0;33mline:290:3[0m, [0;33mcol:56[0m> [0;33mcol:50[0m[0;1;36m tellp[0m [0;32m'pos_type ()'[0m inline
[0;34m| `-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe07778bfc0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m> Inherited
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778c120[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:291:3[0m, [0;33mcol:76[0m> [0;33mcol:56[0m[0;1;36m seekp[0m [0;32m'ostream &(pos_type)'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778c028[0m <[0;33mcol:62[0m, [0;33mcol:71[0m> [0;33mcol:71[0m[0;1;36m __pos[0m [0;32m'pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe07778c1e0[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m> Inherited
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x7fe07778c430[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:292:3[0m, [0;33mcol:101[0m> [0;33mcol:56[0m[0;1;36m seekp[0m [0;32m'ostream &(off_type, ios_base::seekdir)'[0m inline
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778c2b0[0m <[0;33mcol:62[0m, [0;33mcol:71[0m> [0;33mcol:71[0m[0;1;36m __off[0m [0;32m'off_type':'long long'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x7fe07778c318[0m <[0;33mcol:78[0m, [0;33mcol:96[0m> [0;33mcol:96[0m[0;1;36m __dir[0m [0;32m'ios_base::seekdir':'std::ios_base::seekdir'[0m
[0;34m| `-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe07778c4f8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m> Inherited
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x7fe07778c560[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:294:1[0m, [0;33mcol:10[0m> [0;33mcol:1[0m protected
[0;34m`-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x7fe07778c5a8[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:760:39[0m, [0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:295:42[0m> [0;33mcol:25[0m[0;1;36m basic_ostream[0m [0;32m'void ()'[0m implicit-inline
[0;34m  |-[0m[0;1;34mExcludeFromExplicitInstantiationAttr[0m[0;33m 0x7fe07778c668[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__config:799:72[0m>
[0;34m  `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x7fe07778c6c0[0m <[0;33mline:874:26[0m, [0;33mcol:77[0m> ne180100

Layout: <CGRecordLayout
  LLVMType:%"class.std::__1::basic_ostream" = type { ptr, %"class.std::__1::basic_ios.base" }
  NonVirtualBaseLLVMType:%"class.std::__1::basic_ostream.base" = type { ptr }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__functional/hash.h:277:7)
         0 |   size_t __a
         8 |   size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__functional/hash.h:275:5)
         0 |   struct std::_PairT __t
         0 |     size_t first
         8 |     size_t second
         0 |   struct (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__functional/hash.h:277:7) __s
         0 |     size_t __a
         8 |     size_t __b
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::pair<unsigned long, unsigned long>
         0 |   unsigned long first
         8 |   unsigned long second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__functional/hash.h:250:5)
         0 |   float __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union (unnamed at /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/__functional/hash.h:263:5)
         0 |   double __t
         0 |   size_t __a
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::pair<const char *, const char *>
         0 |   const char * first
         8 |   const char * second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__copy_loop<struct std::_ClassicAlgPolicy> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__copy_trivial (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__overload<struct std::__copy_loop<struct std::_ClassicAlgPolicy>, struct std::__copy_trivial> (empty)
         0 |   struct std::__copy_loop<struct std::_ClassicAlgPolicy> (base) (empty)
         0 |   struct std::__copy_trivial (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::pair<const char *, char *>
         0 |   const char * first
         8 |   char * second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::pair<const wchar_t *, const wchar_t *>
         0 |   const wchar_t * first
         8 |   const wchar_t * second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::pair<const wchar_t *, wchar_t *>
         0 |   const wchar_t * first
         8 |   wchar_t * second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::pair<const char16_t *, const char16_t *>
         0 |   const char16_t * first
         8 |   const char16_t * second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::pair<const char16_t *, char16_t *>
         0 |   const char16_t * first
         8 |   char16_t * second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::pair<const char32_t *, const char32_t *>
         0 |   const char32_t * first
         8 |   const char32_t * second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::pair<const char32_t *, char32_t *>
         0 |   const char32_t * first
         8 |   char32_t * second
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__cxx_atomic_wait_test_fn_impl<const volatile struct std::__cxx_atomic_impl<_Bool>, _Bool>
         0 |   const volatile struct std::__cxx_atomic_impl<_Bool> * __a
         8 |   _Bool __val
        12 |   memory_order __order
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__libcpp_atomic_wait_backoff_impl<const volatile struct std::__cxx_atomic_impl<_Bool>, struct std::__cxx_atomic_wait_test_fn_impl<const volatile struct std::__cxx_atomic_impl<_Bool>, _Bool> >
         0 |   const volatile struct std::__cxx_atomic_impl<_Bool> * __a
         8 |   struct std::__cxx_atomic_wait_test_fn_impl<const volatile struct std::__cxx_atomic_impl<_Bool>, _Bool> __test_fn
         8 |     const volatile struct std::__cxx_atomic_impl<_Bool> * __a
        16 |     _Bool __val
        20 |     memory_order __order
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__cxx_atomic_wait_test_fn_impl<const struct std::__cxx_atomic_impl<_Bool>, _Bool>
         0 |   const struct std::__cxx_atomic_impl<_Bool> * __a
         8 |   _Bool __val
        12 |   memory_order __order
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__libcpp_atomic_wait_backoff_impl<const struct std::__cxx_atomic_impl<_Bool>, struct std::__cxx_atomic_wait_test_fn_impl<const struct std::__cxx_atomic_impl<_Bool>, _Bool> >
         0 |   const struct std::__cxx_atomic_impl<_Bool> * __a
         8 |   struct std::__cxx_atomic_wait_test_fn_impl<const struct std::__cxx_atomic_impl<_Bool>, _Bool> __test_fn
         8 |     const struct std::__cxx_atomic_impl<_Bool> * __a
        16 |     _Bool __val
        20 |     memory_order __order
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__allocation_result<char *>
         0 |   char * ptr
         8 |   size_t count
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__allocation_result<wchar_t *>
         0 |   wchar_t * ptr
         8 |   size_t count
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__allocation_result<char16_t *>
         0 |   char16_t * ptr
         8 |   size_t count
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__allocation_result<char32_t *>
         0 |   char32_t * ptr
         8 |   size_t count
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_ostream<char>::sentry
         0 |   _Bool __ok_
         8 |   basic_ostream<char, char_traits<char> > & __os_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::iterator<struct std::output_iterator_tag, void, void, void, void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::ostreambuf_iterator<char>
         0 |   struct std::iterator<struct std::output_iterator_tag, void, void, void, void> (base) (empty)
         0 |   streambuf_type * __sbuf_
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x7fe077788e48[0m <[0;33m/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/ostream:238:3[0m, [0;33mcol:30[0m> [0;33mcol:30[0m referenced class[0;1;36m sentry[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
